[{"code":"ELA/WHST","title":"Writing"},{"code":"ELA/WHST.11-12","title":"Grade 11-12"},{"code":"ELA/WHST.11-12.10","title":"10","desc":"Write routinely over extended time frames (time for reflection and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."},{"code":"ELA/WHST.11-12.9","title":"9","desc":"Draw evidence from informational texts to support analysis, reflection, and research."},{"code":"ELA/WHST.11-12.8","title":"8","desc":"Gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the strengths and limitations of each source in terms of the specific task, purpose, and audience; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and overreliance on any one source and following a standard format for citation."},{"code":"ELA/WHST.11-12.7","title":"7","desc":"Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation."},{"code":"ELA/WHST.11-12.6","title":"6","desc":"Use technology, including the Internet, to produce, publish, and update individual or shared writing products in response to ongoing feedback, including new arguments or information."},{"code":"ELA/WHST.11-12.5","title":"5","desc":"Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience."},{"code":"ELA/WHST.11-12.4","title":"4","desc":"Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience."},{"code":"ELA/WHST.11-12.3","title":"3","desc":"(See note; not applicable as a separate requirement)"},{"code":"ELA/WHST.11-12.2","title":"2","desc":"Write informative/explanatory texts, including the narration of historical events, scientific procedures/experiments, or technical processes."},{"code":"ELA/WHST.11-12.2.e","title":"e","desc":"Provide a concluding statement or section that follows from and supports the information or explanation provided (e.g., articulating implications or the significance of the topic)."},{"code":"ELA/WHST.11-12.2.d","title":"d","desc":"Use precise language, domain-specific vocabulary and techniques such as metaphor, simile, and analogy to manage the complexity of the topic; convey a knowledgeable stance in a style that responds to the discipline and context as well as to the expertise of likely readers."},{"code":"ELA/WHST.11-12.2.c","title":"c","desc":"Use varied transitions and sentence structures to link the major sections of the text, create cohesion, and clarify the relationships among complex ideas and concepts."},{"code":"ELA/WHST.11-12.2.b","title":"b","desc":"Develop the topic thoroughly by selecting the most significant and relevant facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience’s knowledge of the topic."},{"code":"ELA/WHST.11-12.2.a","title":"a","desc":"Introduce a topic and organize complex ideas, concepts, and information so that each new element builds on that which precedes it to create a unified whole; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension."},{"code":"ELA/WHST.11-12.1","title":"1","desc":"Write arguments focused on"},{"code":"ELA/WHST.11-12.1.e","title":"e","desc":"Provide a concluding statement or section that follows from or supports the argument presented."},{"code":"ELA/WHST.11-12.1.d","title":"d","desc":"Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing."},{"code":"ELA/WHST.11-12.1.c","title":"c","desc":"Use words, phrases, and clauses as well as varied syntax to link the major sections of the text, create cohesion, and clarify the relationships between claim(s) and reasons, between reasons and evidence, and between claim(s) and counterclaims."},{"code":"ELA/WHST.11-12.1.b","title":"b","desc":"Develop claim(s) and counterclaims fairly and thoroughly, supplying the most relevant data and evidence for each while pointing out the strengths and limitations of both claim(s) and counterclaims in a discipline-appropriate form that anticipates the audience’s knowledge level, concerns, values, and possible biases."},{"code":"ELA/WHST.11-12.1.a","title":"a","desc":"Introduce precise, knowledgeable claim(s), establish the significance of the claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that logically sequences the claim(s), counterclaims, reasons, and evidence."},{"code":"ELA/WHST.9-10","title":"Grade 9-10"},{"code":"ELA/WHST.9-10.10","title":"10","desc":"Write routinely over extended time frames (time for reflection and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."},{"code":"ELA/WHST.9-10.9","title":"9","desc":"Draw evidence from informational texts to support analysis, reflection, and research."},{"code":"ELA/WHST.9-10.8","title":"8","desc":"Gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the usefulness of each source in answering the research question; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and following a standard format for citation."},{"code":"ELA/WHST.9-10.7","title":"7","desc":"Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation."},{"code":"ELA/WHST.9-10.6","title":"6","desc":"Use technology, including the Internet, to produce, publish, and update individual or shared writing products, taking advantage of technology’s capacity to link to other information and to display information flexibly and dynamically."},{"code":"ELA/WHST.9-10.5","title":"5","desc":"Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience."},{"code":"ELA/WHST.9-10.4","title":"4","desc":"Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience."},{"code":"ELA/WHST.9-10.3","title":"3","desc":"(See note; not applicable as a separate requirement)"},{"code":"ELA/WHST.9-10.2","title":"2","desc":"Write informative/explanatory texts, including the narration of historical events, scientific procedures/ experiments, or technical processes."},{"code":"ELA/WHST.9-10.2.f","title":"f","desc":"Provide a concluding statement or section that follows from and supports the information or explanation presented (e.g., articulating implications or the significance of the topic)."},{"code":"ELA/WHST.9-10.2.e","title":"e","desc":"Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing."},{"code":"ELA/WHST.9-10.2.d","title":"d","desc":"Use precise language and domain-specific vocabulary to manage the complexity of the topic and convey a style appropriate to the discipline and context as well as to the expertise of likely readers."},{"code":"ELA/WHST.9-10.2.c","title":"c","desc":"Use varied transitions and sentence structures to link the major sections of the text, create cohesion, and clarify the relationships among ideas and concepts."},{"code":"ELA/WHST.9-10.2.b","title":"b","desc":"Develop the topic with well-chosen, relevant, and sufficient facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience’s knowledge of the topic."},{"code":"ELA/WHST.9-10.2.a","title":"a","desc":"Introduce a topic and organize ideas, concepts, and information to make important connections and distinctions; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension."},{"code":"ELA/WHST.9-10.1","title":"1","desc":"Write arguments focused on"},{"code":"ELA/WHST.9-10.1.e","title":"e","desc":"Provide a concluding statement or section that follows from or supports the argument presented."},{"code":"ELA/WHST.9-10.1.d","title":"d","desc":"Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing."},{"code":"ELA/WHST.9-10.1.c","title":"c","desc":"Use words, phrases, and clauses to link the major sections of the text, create cohesion, and clarify the relationships between claim(s) and reasons, between reasons and evidence, and between claim(s) and counterclaims."},{"code":"ELA/WHST.9-10.1.b","title":"b","desc":"Develop claim(s) and counterclaims fairly, supplying data and evidence for each while pointing out the strengths and limitations of both claim(s) and counterclaims in a discipline-appropriate form and in a manner that anticipates the audience’s knowledge level and concerns."},{"code":"ELA/WHST.9-10.1.a","title":"a","desc":"Introduce precise claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that establishes clear relationships among the claim(s), counterclaims, reasons, and evidence."},{"code":"ELA/WHST.6-8","title":"Grade 6-8"},{"code":"ELA/WHST.6-8.10","title":"10","desc":"Write routinely over extended time frames (time for reflection and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."},{"code":"ELA/WHST.6-8.9","title":"9","desc":"Draw evidence from informational texts to support analysis, reflection, and research."},{"code":"ELA/WHST.6-8.8","title":"8","desc":"Gather relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and following a standard format for citation."},{"code":"ELA/WHST.6-8.7","title":"7","desc":"Conduct short research projects to answer a question (including a self-generated question), drawing on several sources and generating additional related, focused questions that allow for multiple avenues of exploration."},{"code":"ELA/WHST.6-8.6","title":"6","desc":"Use technology, including the Internet, to produce and publish writing and present the relationships between information and ideas clearly and efficiently."},{"code":"ELA/WHST.6-8.5","title":"5","desc":"With some guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on how well purpose and audience have been addressed."},{"code":"ELA/WHST.6-8.4","title":"4","desc":"Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience."},{"code":"ELA/WHST.6-8.3","title":"3","desc":"(See note; not applicable as a separate requirement)"},{"code":"ELA/WHST.6-8.2","title":"2","desc":"Write informative/explanatory texts, including the narration of historical events, scientific procedures/ experiments, or technical processes."},{"code":"ELA/WHST.6-8.2.f","title":"f","desc":"Provide a concluding statement or section that follows from and supports the information or explanation presented."},{"code":"ELA/WHST.6-8.2.e","title":"e","desc":"Establish and maintain a formal style and objective tone."},{"code":"ELA/WHST.6-8.2.d","title":"d","desc":"Use precise language and domain-specific vocabulary to inform about or explain the topic."},{"code":"ELA/WHST.6-8.2.c","title":"c","desc":"Use appropriate and varied transitions to create cohesion and clarify the relationships among ideas and concepts."},{"code":"ELA/WHST.6-8.2.b","title":"b","desc":"Develop the topic with relevant, well-chosen facts, definitions, concrete details, quotations, or other information and examples."},{"code":"ELA/WHST.6-8.2.a","title":"a","desc":"Introduce a topic clearly, previewing what is to follow; organize ideas, concepts, and information into broader categories as appropriate to achieving purpose; include formatting (e.g., headings), graphics (e.g., charts, tables), and multimedia when useful to aiding comprehension."},{"code":"ELA/WHST.6-8.1","title":"1","desc":"Write arguments focused on"},{"code":"ELA/WHST.6-8.1.e","title":"e","desc":"Provide a concluding statement or section that follows from and supports the argument presented."},{"code":"ELA/WHST.6-8.1.d","title":"d","desc":"Establish and maintain a formal style."},{"code":"ELA/WHST.6-8.1.c","title":"c","desc":"Use words, phrases, and clauses to create cohesion and clarify the relationships among claim(s), counterclaims, reasons, and evidence."},{"code":"ELA/WHST.6-8.1.b","title":"b","desc":"Support claim(s) with logical reasoning and relevant, accurate data and evidence that demonstrate an understanding of the topic or text, using credible sources."},{"code":"ELA/WHST.6-8.1.a","title":"a","desc":"Introduce claim(s) about a topic or issue, acknowledge and distinguish the claim(s) from alternate or opposing claims, and organize the reasons and evidence logically."},{"code":"ELA/W","title":"Writing"},{"code":"ELA/W.11-12","title":"Grade 11-12"},{"code":"ELA/W.11-12.10","title":"10","desc":"Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences."},{"code":"ELA/W.11-12.9","title":"9","desc":"Draw evidence from literary or informational texts to support analysis, reflection, and research."},{"code":"ELA/W.11-12.9.b","title":"b","desc":"Apply"},{"code":"ELA/W.11-12.9.a","title":"a","desc":"Apply"},{"code":"ELA/W.11-12.8","title":"8","desc":"Gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the strengths and limitations of each source in terms of the task, purpose, and audience; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and overreliance on any one source and following a standard format for citation."},{"code":"ELA/W.11-12.7","title":"7","desc":"Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation."},{"code":"ELA/W.11-12.6","title":"6","desc":"Use technology, including the Internet, to produce, publish, and update individual or shared writing products in response to ongoing feedback, including new arguments or information."},{"code":"ELA/W.11-12.5","title":"5","desc":"Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including grades 11-12"},{"code":"ELA/W.11-12.4","title":"4","desc":"Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1-3 above.)"},{"code":"ELA/W.11-12.3","title":"3","desc":"Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well-structured event sequences."},{"code":"ELA/W.11-12.3.e","title":"e","desc":"Provide a conclusion that follows from and reflects on what is experienced, observed, or resolved over the course of the narrative."},{"code":"ELA/W.11-12.3.d","title":"d","desc":"Use precise words and phrases, telling details, and sensory language to convey a vivid picture of the experiences, events, setting, and/or characters."},{"code":"ELA/W.11-12.3.c","title":"c","desc":"Use a variety of techniques to sequence events so that they build on one another to create a coherent whole and build toward a particular tone and outcome (e.g., a sense of mystery, suspense, growth, or resolution)."},{"code":"ELA/W.11-12.3.b","title":"b","desc":"Use narrative techniques, such as dialogue, pacing, description, reflection, and multiple plot lines, to develop experiences, events, and/or characters."},{"code":"ELA/W.11-12.3.a","title":"a","desc":"Engage and orient the reader by setting out a problem, situation, or observation and its significance, establishing one or multiple point(s) of view, and introducing a narrator and/or characters; create a smooth progression of experiences or events."},{"code":"ELA/W.11-12.2","title":"2","desc":"Write informative/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content."},{"code":"ELA/W.11-12.2.f","title":"f","desc":"Provide a concluding statement or section that follows from and supports the information or explanation presented (e.g., articulating implications or the significance of the topic)."},{"code":"ELA/W.11-12.2.e","title":"e","desc":"Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing."},{"code":"ELA/W.11-12.2.d","title":"d","desc":"Use precise language, domain-specific vocabulary, and techniques such as metaphor, simile, and analogy to manage the complexity of the topic."},{"code":"ELA/W.11-12.2.c","title":"c","desc":"Use appropriate and varied transitions and syntax to link the major sections of the text, create cohesion, and clarify the relationships among complex ideas and concepts."},{"code":"ELA/W.11-12.2.b","title":"b","desc":"Develop the topic thoroughly by selecting the most significant and relevant facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience’s knowledge of the topic."},{"code":"ELA/W.11-12.2.a","title":"a","desc":"Introduce a topic; organize complex ideas, concepts, and information so that each new element builds on that which precedes it to create a unified whole; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension."},{"code":"ELA/W.11-12.1","title":"1","desc":"Write arguments to support claims in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence."},{"code":"ELA/W.11-12.1.e","title":"e","desc":"Provide a concluding statement or section that follows from and supports the argument presented."},{"code":"ELA/W.11-12.1.d","title":"d","desc":"Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing."},{"code":"ELA/W.11-12.1.c","title":"c","desc":"Use words, phrases, and clauses as well as varied syntax to link the major sections of the text, create cohesion, and clarify the relationships between claim(s) and reasons, between reasons and evidence, and between claim(s) and counterclaims."},{"code":"ELA/W.11-12.1.b","title":"b","desc":"Develop claim(s) and counterclaims fairly and thoroughly, supplying the most relevant evidence for each while pointing out the strengths and limitations of both in a manner that anticipates the audience’s knowledge level, concerns, values, and possible biases."},{"code":"ELA/W.11-12.1.a","title":"a","desc":"Introduce precise, knowledgeable claim(s), establish the significance of the claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that logically sequences claim(s), counterclaims, reasons, and evidence."},{"code":"ELA/W.9-10","title":"Grade 9-10"},{"code":"ELA/W.9-10.10","title":"10","desc":"Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences."},{"code":"ELA/W.9-10.9","title":"9","desc":"Draw evidence from literary or informational texts to support analysis, reflection, and research."},{"code":"ELA/W.9-10.9.b","title":"b","desc":"Apply"},{"code":"ELA/W.9-10.9.a","title":"a","desc":"Apply"},{"code":"ELA/W.9-10.8","title":"8","desc":"Gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the usefulness of each source in answering the research question; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and following a standard format for citation."},{"code":"ELA/W.9-10.7","title":"7","desc":"Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation."},{"code":"ELA/W.9-10.6","title":"6","desc":"Use technology, including the Internet, to produce, publish, and update individual or shared writing products, taking advantage of technology’s capacity to link to other information and to display information flexibly and dynamically."},{"code":"ELA/W.9-10.5","title":"5","desc":"Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including grades 9-10"},{"code":"ELA/W.9-10.4","title":"4","desc":"Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1-3 above.)"},{"code":"ELA/W.9-10.3","title":"3","desc":"Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well-structured event sequences."},{"code":"ELA/W.9-10.3.e","title":"e","desc":"Provide a conclusion that follows from and reflects on what is experienced, observed, or resolved over the course of the narrative."},{"code":"ELA/W.9-10.3.d","title":"d","desc":"Use precise words and phrases, telling details, and sensory language to convey a vivid picture of the experiences, events, setting, and/or characters."},{"code":"ELA/W.9-10.3.c","title":"c","desc":"Use a variety of techniques to sequence events so that they build on one another to create a coherent whole."},{"code":"ELA/W.9-10.3.b","title":"b","desc":"Use narrative techniques, such as dialogue, pacing, description, reflection, and multiple plot lines, to develop experiences, events, and/or characters."},{"code":"ELA/W.9-10.3.a","title":"a","desc":"Engage and orient the reader by setting out a problem, situation, or observation, establishing one or multiple point(s) of view, and introducing a narrator and/or characters; create a smooth progression of experiences or events."},{"code":"ELA/W.9-10.2","title":"2","desc":"Write informative/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content."},{"code":"ELA/W.9-10.2.f","title":"f","desc":"Provide a concluding statement or section that follows from and supports the information or explanation presented (e.g., articulating implications or the significance of the topic)."},{"code":"ELA/W.9-10.2.e","title":"e","desc":"Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing."},{"code":"ELA/W.9-10.2.d","title":"d","desc":"Use precise language and domain-specific vocabulary to manage the complexity of the topic."},{"code":"ELA/W.9-10.2.c","title":"c","desc":"Use appropriate and varied transitions to link the major sections of the text, create cohesion, and clarify the relationships among complex ideas and concepts."},{"code":"ELA/W.9-10.2.b","title":"b","desc":"Develop the topic with well-chosen, relevant, and sufficient facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience’s knowledge of the topic."},{"code":"ELA/W.9-10.2.a","title":"a","desc":"Introduce a topic; organize complex ideas, concepts, and information to make important connections and distinctions; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension."},{"code":"ELA/W.9-10.1","title":"1","desc":"Write arguments to support claims in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence."},{"code":"ELA/W.9-10.1.e","title":"e","desc":"Provide a concluding statement or section that follows from and supports the argument presented."},{"code":"ELA/W.9-10.1.d","title":"d","desc":"Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing."},{"code":"ELA/W.9-10.1.c","title":"c","desc":"Use words, phrases, and clauses to link the major sections of the text, create cohesion, and clarify the relationships between claim(s) and reasons, between reasons and evidence, and between claim(s) and counterclaims."},{"code":"ELA/W.9-10.1.b","title":"b","desc":"Develop claim(s) and counterclaims fairly, supplying evidence for each while pointing out the strengths and limitations of both in a manner that anticipates the audience’s knowledge level and concerns."},{"code":"ELA/W.9-10.1.a","title":"a","desc":"Introduce precise claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that establishes clear relationships among claim(s), counterclaims, reasons, and evidence."},{"code":"ELA/W.K","title":"Kindergarten"},{"code":"ELA/W.K.10","title":"10","desc":"(W.K.10 begins in grade 3)"},{"code":"ELA/W.K.9","title":"9","desc":"(W.K.9 begins in grade 4)"},{"code":"ELA/W.K.8","title":"8","desc":"With guidance and support from adults, recall information from experiences or gather information from provided sources to answer a question."},{"code":"ELA/W.K.7","title":"7","desc":"Participate in shared research and writing projects (e.g., explore a number of books by a favorite author and express opinions about them)."},{"code":"ELA/W.K.6","title":"6","desc":"With guidance and support from adults, explore a variety of digital tools to produce and publish writing, including in collaboration with peers."},{"code":"ELA/W.K.5","title":"5","desc":"With guidance and support from adults, respond to questions and suggestions from peers and add details to strengthen writing as needed."},{"code":"ELA/W.K.4","title":"4","desc":"(W.K.4 begins in grade 3)"},{"code":"ELA/W.K.3","title":"3","desc":"Use a combination of drawing, dictating, and writing to narrate a single event or several loosely linked events, tell about the events in the order in which they occurred, and provide a reaction to what happened."},{"code":"ELA/W.K.2","title":"2","desc":"Use a combination of drawing, dictating, and writing to compose informative/explanatory texts in which they name what they are writing about and supply some information about the topic."},{"code":"ELA/W.K.1","title":"1","desc":"Use a combination of drawing, dictating, and writing to compose opinion pieces in which they tell a reader the topic or the name of the book they are writing about and state an opinion or preference about the topic or book (e.g.,"},{"code":"ELA/W.8","title":"Grade 8"},{"code":"ELA/W.8.10","title":"10","desc":"Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."},{"code":"ELA/W.8.9","title":"9","desc":"Draw evidence from literary or informational texts to support analysis, reflection, and research."},{"code":"ELA/W.8.9.b","title":"b","desc":"Apply"},{"code":"ELA/W.8.9.a","title":"a","desc":"Apply"},{"code":"ELA/W.8.8","title":"8","desc":"Gather relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and following a standard format for citation."},{"code":"ELA/W.8.7","title":"7","desc":"Conduct short research projects to answer a question (including a self-generated question), drawing on several sources and generating additional related, focused questions that allow for multiple avenues of exploration."},{"code":"ELA/W.8.6","title":"6","desc":"Use technology, including the Internet, to produce and publish writing and present the relationships between information and ideas efficiently as well as to interact and collaborate with others."},{"code":"ELA/W.8.5","title":"5","desc":"With some guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on how well purpose and audience have been addressed. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including grade 8"},{"code":"ELA/W.8.4","title":"4","desc":"Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1-3 above.)"},{"code":"ELA/W.8.3","title":"3","desc":"Write narratives to develop real or imagined experiences or events using effective technique, relevant descriptive details, and well-structured event sequences."},{"code":"ELA/W.8.3.e","title":"e","desc":"Provide a conclusion that follows from and reflects on the narrated experiences or events."},{"code":"ELA/W.8.3.d","title":"d","desc":"Use precise words and phrases, relevant descriptive details, and sensory language to capture the action and convey experiences and events."},{"code":"ELA/W.8.3.c","title":"c","desc":"Use a variety of transition words, phrases, and clauses to convey sequence, signal shifts from one time frame or setting to another, and show the relationships among experiences and events."},{"code":"ELA/W.8.3.b","title":"b","desc":"Use narrative techniques, such as dialogue, pacing, description, and reflection, to develop experiences, events, and/or characters."},{"code":"ELA/W.8.3.a","title":"a","desc":"Engage and orient the reader by establishing a context and point of view and introducing a narrator and/or characters; organize an event sequence that unfolds naturally and logically."},{"code":"ELA/W.8.2","title":"2","desc":"Write informative/explanatory texts to examine a topic and convey ideas, concepts, and information through the selection, organization, and analysis of relevant content."},{"code":"ELA/W.8.2.f","title":"f","desc":"Provide a concluding statement or section that follows from and supports the information or explanation presented."},{"code":"ELA/W.8.2.e","title":"e","desc":"Establish and maintain a formal style."},{"code":"ELA/W.8.2.d","title":"d","desc":"Use precise language and domain-specific vocabulary to inform about or explain the topic."},{"code":"ELA/W.8.2.c","title":"c","desc":"Use appropriate and varied transitions to create cohesion and clarify the relationships among ideas and concepts."},{"code":"ELA/W.8.2.b","title":"b","desc":"Develop the topic with relevant, well-chosen facts, definitions, concrete details, quotations, or other information and examples."},{"code":"ELA/W.8.2.a","title":"a","desc":"Introduce a topic clearly, previewing what is to follow; organize ideas, concepts, and information into broader categories; include formatting (e.g., headings), graphics (e.g., charts, tables), and multimedia when useful to aiding comprehension."},{"code":"ELA/W.8.1","title":"1","desc":"Write arguments to support claims with clear reasons and relevant evidence"},{"code":"ELA/W.8.1.e","title":"e","desc":"Provide a concluding statement or section that follows from and supports the argument presented."},{"code":"ELA/W.8.1.d","title":"d","desc":"Establish and maintain a formal style."},{"code":"ELA/W.8.1.c","title":"c","desc":"Use words, phrases, and clauses to create cohesion and clarify the relationships among claim(s), counterclaims, reasons, and evidence."},{"code":"ELA/W.8.1.b","title":"b","desc":"Support claim(s) with logical reasoning and relevant evidence, using accurate, credible sources and demonstrating an understanding of the topic or text."},{"code":"ELA/W.8.1.a","title":"a","desc":"Introduce claim(s), acknowledge and distinguish the claim(s) from alternate or opposing claims, and organize the reasons and evidence logically."},{"code":"ELA/W.7","title":"Grade 7"},{"code":"ELA/W.7.10","title":"10","desc":"Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."},{"code":"ELA/W.7.9","title":"9","desc":"Draw evidence from literary or informational texts to support analysis, reflection, and research."},{"code":"ELA/W.7.9.b","title":"b","desc":"Apply"},{"code":"ELA/W.7.9.a","title":"a","desc":"Apply"},{"code":"ELA/W.7.8","title":"8","desc":"Gather relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and following a standard format for citation."},{"code":"ELA/W.7.7","title":"7","desc":"Conduct short research projects to answer a question, drawing on several sources and generating additional related, focused questions for further research and investigation."},{"code":"ELA/W.7.6","title":"6","desc":"Use technology, including the Internet, to produce and publish writing and link to and cite sources as well as to interact and collaborate with others, including linking to and citing sources."},{"code":"ELA/W.7.5","title":"5","desc":"With some guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on how well purpose and audience have been addressed. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including grade 7"},{"code":"ELA/W.7.4","title":"4","desc":"Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1-3 above.)"},{"code":"ELA/W.7.3","title":"3","desc":"Write narratives to develop real or imagined experiences or events using effective technique, relevant descriptive details, and well-structured event sequences."},{"code":"ELA/W.7.3.e","title":"e","desc":"Provide a conclusion that follows from and reflects on the narrated experiences or events."},{"code":"ELA/W.7.3.d","title":"d","desc":"Use precise words and phrases, relevant descriptive details, and sensory language to capture the action and convey experiences and events."},{"code":"ELA/W.7.3.c","title":"c","desc":"Use a variety of transition words, phrases, and clauses to convey sequence and signal shifts from one time frame or setting to another."},{"code":"ELA/W.7.3.b","title":"b","desc":"Use narrative techniques, such as dialogue, pacing, and description, to develop experiences, events, and/or characters."},{"code":"ELA/W.7.3.a","title":"a","desc":"Engage and orient the reader by establishing a context and point of view and introducing a narrator and/or characters; organize an event sequence that unfolds naturally and logically."},{"code":"ELA/W.7.2","title":"2","desc":"Write informative/explanatory texts to examine a topic and convey ideas, concepts, and information through the selection, organization, and analysis of relevant content."},{"code":"ELA/W.7.2.f","title":"f","desc":"Provide a concluding statement or section that follows from and supports the information or explanation presented."},{"code":"ELA/W.7.2.e","title":"e","desc":"Establish and maintain a formal style."},{"code":"ELA/W.7.2.d","title":"d","desc":"Use precise language and domain-specific vocabulary to inform about or explain the topic."},{"code":"ELA/W.7.2.c","title":"c","desc":"Use appropriate transitions to create cohesion and clarify the relationships among ideas and concepts."},{"code":"ELA/W.7.2.b","title":"b","desc":"Develop the topic with relevant facts, definitions, concrete details, quotations, or other information and examples."},{"code":"ELA/W.7.2.a","title":"a","desc":"Introduce a topic clearly, previewing what is to follow; organize ideas, concepts, and information, using strategies such as definition, classification, comparison/contrast, and cause/effect; include formatting (e.g., headings), graphics (e.g., charts, tables), and multimedia when useful to aiding comprehension."},{"code":"ELA/W.7.1","title":"1","desc":"Write arguments to support claims with clear reasons and relevant evidence."},{"code":"ELA/W.7.1.e","title":"e","desc":"Provide a concluding statement or section that follows from and supports the argument presented."},{"code":"ELA/W.7.1.d","title":"d","desc":"Establish and maintain a formal style."},{"code":"ELA/W.7.1.c","title":"c","desc":"Use words, phrases, and clauses to create cohesion and clarify the relationships among claim(s), reasons, and evidence."},{"code":"ELA/W.7.1.b","title":"b","desc":"Support claim(s) with logical reasoning and relevant evidence, using accurate, credible sources and demonstrating an understanding of the topic or text."},{"code":"ELA/W.7.1.a","title":"a","desc":"Introduce claim(s), acknowledge alternate or opposing claims, and organize the reasons and evidence logically."},{"code":"ELA/W.6","title":"Grade 6"},{"code":"ELA/W.6.10","title":"10","desc":"Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."},{"code":"ELA/W.6.9","title":"9","desc":"Draw evidence from literary or informational texts to support analysis, reflection, and research."},{"code":"ELA/W.6.9.b","title":"b","desc":"Apply"},{"code":"ELA/W.6.9.a","title":"a","desc":"Apply"},{"code":"ELA/W.6.8","title":"8","desc":"Gather relevant information from multiple print and digital sources; assess the credibility of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and providing basic bibliographic information for sources."},{"code":"ELA/W.6.7","title":"7","desc":"Conduct short research projects to answer a question, drawing on several sources and refocusing the inquiry when appropriate."},{"code":"ELA/W.6.6","title":"6","desc":"Use technology, including the Internet, to produce and publish writing as well as to interact and collaborate with others; demonstrate sufficient command of keyboarding skills to type a minimum of three pages in a single sitting."},{"code":"ELA/W.6.5","title":"5","desc":"With some guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including grade 6"},{"code":"ELA/W.6.4","title":"4","desc":"Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1-3 above.)"},{"code":"ELA/W.6.3","title":"3","desc":"Write narratives to develop real or imagined experiences or events using effective technique, relevant descriptive details, and well-structured event sequences."},{"code":"ELA/W.6.3.e","title":"e","desc":"Provide a conclusion that follows from the narrated experiences or events."},{"code":"ELA/W.6.3.d","title":"d","desc":"Use precise words and phrases, relevant descriptive details, and sensory language to convey experiences and events."},{"code":"ELA/W.6.3.c","title":"c","desc":"Use a variety of transition words, phrases, and clauses to convey sequence and signal shifts from one time frame or setting to another."},{"code":"ELA/W.6.3.b","title":"b","desc":"Use narrative techniques, such as dialogue, pacing, and description, to develop experiences, events, and/or characters."},{"code":"ELA/W.6.3.a","title":"a","desc":"Engage and orient the reader by establishing a context and introducing a narrator and/or characters; organize an event sequence that unfolds naturally and logically."},{"code":"ELA/W.6.2","title":"2","desc":"Write informative/explanatory texts to examine a topic and convey ideas, concepts, and information through the selection, organization, and analysis of relevant content."},{"code":"ELA/W.6.2.f","title":"f","desc":"Provide a concluding statement or section that follows from the information or explanation presented."},{"code":"ELA/W.6.2.e","title":"e","desc":"Establish and maintain a formal style."},{"code":"ELA/W.6.2.d","title":"d","desc":"Use precise language and domain-specific vocabulary to inform about or explain the topic."},{"code":"ELA/W.6.2.c","title":"c","desc":"Use appropriate transitions to clarify the relationships among ideas and concepts."},{"code":"ELA/W.6.2.b","title":"b","desc":"Develop the topic with relevant facts, definitions, concrete details, quotations, or other information and examples."},{"code":"ELA/W.6.2.a","title":"a","desc":"Introduce a topic; organize ideas, concepts, and information, using strategies such as definition, classification, comparison/contrast, and cause/effect; include formatting (e.g., headings), graphics (e.g., charts, tables), and multimedia when useful to aiding comprehension."},{"code":"ELA/W.6.1","title":"1","desc":"Write arguments to support claims with clear reasons and relevant evidence."},{"code":"ELA/W.6.1.e","title":"e","desc":"Provide a concluding statement or section that follows from the argument presented."},{"code":"ELA/W.6.1.d","title":"d","desc":"Establish and maintain a formal style."},{"code":"ELA/W.6.1.c","title":"c","desc":"Use words, phrases, and clauses to clarify the relationships among claim(s) and reasons."},{"code":"ELA/W.6.1.b","title":"b","desc":"Support claim(s) with clear reasons and relevant evidence, using credible sources and demonstrating an understanding of the topic or text."},{"code":"ELA/W.6.1.a","title":"a","desc":"Introduce claim(s) and organize the reasons and evidence clearly."},{"code":"ELA/W.5","title":"Grade 5"},{"code":"ELA/W.5.10","title":"10","desc":"Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."},{"code":"ELA/W.5.9","title":"9","desc":"Draw evidence from literary or informational texts to support analysis, reflection, and research."},{"code":"ELA/W.5.9.b","title":"b","desc":"Apply"},{"code":"ELA/W.5.9.a","title":"a","desc":"Apply"},{"code":"ELA/W.5.8","title":"8","desc":"Recall relevant information from experiences or gather relevant information from print and digital sources; summarize or paraphrase information in notes and finished work, and provide a list of sources."},{"code":"ELA/W.5.7","title":"7","desc":"Conduct short research projects that use several sources to build knowledge through investigation of different aspects of a topic."},{"code":"ELA/W.5.6","title":"6","desc":"With some guidance and support from adults, use technology, including the Internet, to produce and publish writing as well as to interact and collaborate with others; demonstrate sufficient command of keyboarding skills to type a minimum of two pages in a single sitting."},{"code":"ELA/W.5.5","title":"5","desc":"With guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including grade 5"},{"code":"ELA/W.5.4","title":"4","desc":"Produce clear and coherent writing in which the development and organization are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1-3 above.)"},{"code":"ELA/W.5.3","title":"3","desc":"Write narratives to develop real or imagined experiences or events using effective technique, descriptive details, and clear event sequences."},{"code":"ELA/W.5.3.e","title":"e","desc":"Provide a conclusion that follows from the narrated experiences or events."},{"code":"ELA/W.5.3.d","title":"d","desc":"Use concrete words and phrases and sensory details to convey experiences and events precisely."},{"code":"ELA/W.5.3.c","title":"c","desc":"Use a variety of transitional words, phrases, and clauses to manage the sequence of events."},{"code":"ELA/W.5.3.b","title":"b","desc":"Use narrative techniques, such as dialogue, description, and pacing, to develop experiences and events or show the responses of characters to situations."},{"code":"ELA/W.5.3.a","title":"a","desc":"Orient the reader by establishing a situation and introducing a narrator and/or characters; organize an event sequence that unfolds naturally."},{"code":"ELA/W.5.2","title":"2","desc":"Write informative/explanatory texts to examine a topic and convey ideas and information clearly."},{"code":"ELA/W.5.2.e","title":"e","desc":"Provide a concluding statement or section related to the information or explanation presented."},{"code":"ELA/W.5.2.d","title":"d","desc":"Use precise language and domain-specific vocabulary to inform about or explain the topic."},{"code":"ELA/W.5.2.c","title":"c","desc":"Link ideas within and across categories of information using words, phrases, and clauses (e.g.,"},{"code":"ELA/W.5.2.b","title":"b","desc":"Develop the topic with facts, definitions, concrete details, quotations, or other information and examples related to the topic."},{"code":"ELA/W.5.2.a","title":"a","desc":"Introduce a topic clearly, provide a general observation and focus, and group related information logically; include formatting (e.g., headings), illustrations, and multimedia when useful to aiding comprehension."},{"code":"ELA/W.5.1","title":"1","desc":"Write opinion pieces on topics or texts, supporting a point of view with reasons and information."},{"code":"ELA/W.5.1.d","title":"d","desc":"Provide a concluding statement or section related to the opinion presented."},{"code":"ELA/W.5.1.c","title":"c","desc":"Link opinion and reasons using words, phrases, and clauses (e.g.,"},{"code":"ELA/W.5.1.b","title":"b","desc":"Provide logically ordered reasons that are supported by facts and details."},{"code":"ELA/W.5.1.a","title":"a","desc":"Introduce a topic or text clearly, state an opinion, and create an organizational structure in which ideas are logically grouped to support the writer’s purpose."},{"code":"ELA/W.4","title":"Grade 4"},{"code":"ELA/W.4.10","title":"10","desc":"Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."},{"code":"ELA/W.4.9","title":"9","desc":"Draw evidence from literary or informational texts to support analysis, reflection, and research."},{"code":"ELA/W.4.9.b","title":"b","desc":"Apply"},{"code":"ELA/W.4.9.a","title":"a","desc":"Apply"},{"code":"ELA/W.4.8","title":"8","desc":"Recall relevant information from experiences or gather relevant information from print and digital sources; take notes and categorize information, and provide a list of sources."},{"code":"ELA/W.4.7","title":"7","desc":"Conduct short research projects that build knowledge through investigation of different aspects of a topic."},{"code":"ELA/W.4.6","title":"6","desc":"With some guidance and support from adults, use technology, including the Internet, to produce and publish writing as well as to interact and collaborate with others; demonstrate sufficient command of keyboarding skills to type a minimum of one page in a single sitting."},{"code":"ELA/W.4.5","title":"5","desc":"With guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, and editing. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including grade 4"},{"code":"ELA/W.4.4","title":"4","desc":"Produce clear and coherent writing in which the development and organization are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1-3 above.)"},{"code":"ELA/W.4.3","title":"3","desc":"Write narratives to develop real or imagined experiences or events using effective technique, descriptive details, and clear event sequences."},{"code":"ELA/W.4.3.e","title":"e","desc":"Provide a conclusion that follows from the narrated experiences or events."},{"code":"ELA/W.4.3.d","title":"d","desc":"Use concrete words and phrases and sensory details to convey experiences and events precisely."},{"code":"ELA/W.4.3.c","title":"c","desc":"Use a variety of transitional words and phrases to manage the sequence of events."},{"code":"ELA/W.4.3.b","title":"b","desc":"Use dialogue and description to develop experiences and events or show the responses of characters to situations."},{"code":"ELA/W.4.3.a","title":"a","desc":"Orient the reader by establishing a situation and introducing a narrator and/or characters; organize an event sequence that unfolds naturally."},{"code":"ELA/W.4.2","title":"2","desc":"Write informative/explanatory texts to examine a topic and convey ideas and information clearly."},{"code":"ELA/W.4.2.e","title":"e","desc":"Provide a concluding statement or section related to the information or explanation presented."},{"code":"ELA/W.4.2.d","title":"d","desc":"Use precise language and domain-specific vocabulary to inform about or explain the topic."},{"code":"ELA/W.4.2.c","title":"c","desc":"Link ideas within categories of information using words and phrases (e.g.,"},{"code":"ELA/W.4.2.b","title":"b","desc":"Develop the topic with facts, definitions, concrete details, quotations, or other information and examples related to the topic."},{"code":"ELA/W.4.2.a","title":"a","desc":"Introduce a topic clearly and group related information in paragraphs and sections; include formatting (e.g., headings), illustrations, and multimedia when useful to aiding comprehension."},{"code":"ELA/W.4.1","title":"1","desc":"Write opinion pieces on topics or texts, supporting a point of view with reasons and information."},{"code":"ELA/W.4.1.d","title":"d","desc":"Provide a concluding statement or section related to the opinion presented."},{"code":"ELA/W.4.1.c","title":"c","desc":"Link opinion and reasons using words and phrases (e.g.,"},{"code":"ELA/W.4.1.b","title":"b","desc":"Provide reasons that are supported by facts and details."},{"code":"ELA/W.4.1.a","title":"a","desc":"Introduce a topic or text clearly, state an opinion, and create an organizational structure in which related ideas are grouped to support the writer’s purpose."},{"code":"ELA/W.3","title":"Grade 3"},{"code":"ELA/W.3.10","title":"10","desc":"Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."},{"code":"ELA/W.3.9","title":"9","desc":"(W.3.9 begins in grade 4)"},{"code":"ELA/W.3.8","title":"8","desc":"Recall information from experiences or gather information from print and digital sources; take brief notes on sources and sort evidence into provided categories."},{"code":"ELA/W.3.7","title":"7","desc":"Conduct short research projects that build knowledge about a topic."},{"code":"ELA/W.3.6","title":"6","desc":"With guidance and support from adults, use technology to produce and publish writing (using keyboarding skills) as well as to interact and collaborate with others."},{"code":"ELA/W.3.5","title":"5","desc":"With guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, and editing. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including grade 3"},{"code":"ELA/W.3.4","title":"4","desc":"With guidance and support from adults, produce writing in which the development and organization are appropriate to task and purpose. (Grade-specific expectations for writing types are defined in standards 1-3 above.)"},{"code":"ELA/W.3.3","title":"3","desc":"Write narratives to develop real or imagined experiences or events using effective technique, descriptive details, and clear event sequences."},{"code":"ELA/W.3.3.d","title":"d","desc":"Provide a sense of closure."},{"code":"ELA/W.3.3.c","title":"c","desc":"Use temporal words and phrases to signal event order."},{"code":"ELA/W.3.3.b","title":"b","desc":"Use dialogue and descriptions of actions, thoughts, and feelings to develop experiences and events or show the response of characters to situations."},{"code":"ELA/W.3.3.a","title":"a","desc":"Establish a situation and introduce a narrator and/or characters; organize an event sequence that unfolds naturally."},{"code":"ELA/W.3.2","title":"2","desc":"Write informative/explanatory texts to examine a topic and convey ideas and information clearly."},{"code":"ELA/W.3.2.d","title":"d","desc":"Provide a concluding statement or section."},{"code":"ELA/W.3.2.c","title":"c","desc":"Use linking words and phrases (e.g.,"},{"code":"ELA/W.3.2.b","title":"b","desc":"Develop the topic with facts, definitions, and details."},{"code":"ELA/W.3.2.a","title":"a","desc":"Introduce a topic and group related information together; include illustrations when useful to aiding comprehension."},{"code":"ELA/W.3.1","title":"1","desc":"Write opinion pieces on topics or texts, supporting a point of view with reasons."},{"code":"ELA/W.3.1.d","title":"d","desc":"Provide a concluding statement or section."},{"code":"ELA/W.3.1.c","title":"c","desc":"Use linking words and phrases (e.g.,"},{"code":"ELA/W.3.1.b","title":"b","desc":"Provide reasons that support the opinion."},{"code":"ELA/W.3.1.a","title":"a","desc":"Introduce the topic or text they are writing about, state an opinion, and create an organizational structure that lists reasons."},{"code":"ELA/W.2","title":"Grade 2"},{"code":"ELA/W.2.10","title":"10","desc":"(W.2.10 begins in grade 3)"},{"code":"ELA/W.2.9","title":"9","desc":"(W.2.9 begins in grade 4)"},{"code":"ELA/W.2.8","title":"8","desc":"Recall information from experiences or gather information from provided sources to answer a question."},{"code":"ELA/W.2.7","title":"7","desc":"Participate in shared research and writing projects (e.g., read a number of books on a single topic to produce a report; record science observations)."},{"code":"ELA/W.2.6","title":"6","desc":"With guidance and support from adults, use a variety of digital tools to produce and publish writing, including in collaboration with peers."},{"code":"ELA/W.2.5","title":"5","desc":"With guidance and support from adults and peers, focus on a topic and strengthen writing as needed by revising and editing."},{"code":"ELA/W.2.4","title":"4","desc":"(W.2.4 begins in grade 3)"},{"code":"ELA/W.2.3","title":"3","desc":"Write narratives in which they recount a well-elaborated event or short sequence of events, include details to describe actions, thoughts, and feelings, use temporal words to signal event order, and provide a sense of closure."},{"code":"ELA/W.2.2","title":"2","desc":"Write informative/explanatory texts in which they introduce a topic, use facts and definitions to develop points, and provide a concluding statement or section."},{"code":"ELA/W.2.1","title":"1","desc":"Write opinion pieces in which they introduce the topic or book they are writing about, state an opinion, supply reasons that support the opinion, use linking words (e.g.,"},{"code":"ELA/W.1","title":"Grade 1"},{"code":"ELA/W.1.10","title":"10","desc":"(W.1.10 begins in grade 3)"},{"code":"ELA/W.1.9","title":"9","desc":"(W.1.9 begins in grade 4)"},{"code":"ELA/W.1.8","title":"8","desc":"With guidance and support from adults, recall information from experiences or gather information from provided sources to answer a question."},{"code":"ELA/W.1.7","title":"7","desc":"Participate in shared research and writing projects (e.g., explore a number of “how-to” books on a given topic and use them to write a sequence of instructions)."},{"code":"ELA/W.1.6","title":"6","desc":"With guidance and support from adults, use a variety of digital tools to produce and publish writing, including in collaboration with peers."},{"code":"ELA/W.1.5","title":"5","desc":"With guidance and support from adults, focus on a topic, respond to questions and suggestions from peers, and add details to strengthen writing as needed."},{"code":"ELA/W.1.4","title":"4","desc":"(W.1.4 begins in grade 3)"},{"code":"ELA/W.1.3","title":"3","desc":"Write narratives in which they recount two or more appropriately sequenced events, include some details regarding what happened, use temporal words to signal event order, and provide some sense of closure."},{"code":"ELA/W.1.2","title":"2","desc":"Write informative/explanatory texts in which they name a topic, supply some facts about the topic, and provide some sense of closure."},{"code":"ELA/W.1.1","title":"1","desc":"Write opinion pieces in which they introduce the topic or name the book they are writing about, state an opinion, supply a reason for the opinion, and provide some sense of closure."},{"code":"ELA/SL","title":"Speaking & Listening"},{"code":"ELA/SL.11-12","title":"Grade 11-12"},{"code":"ELA/SL.11-12.6","title":"6","desc":"Adapt speech to a variety of contexts and tasks, demonstrating a command of formal English when indicated or appropriate. (See grades 11-12 Language standards 1 and 3"},{"code":"ELA/SL.11-12.5","title":"5","desc":"Make strategic use of digital media (e.g., textual, graphical, audio, visual, and interactive elements) in presentations to enhance understanding of findings, reasoning, and evidence and to add interest."},{"code":"ELA/SL.11-12.4","title":"4","desc":"Present information, findings, and supporting evidence, conveying a clear and distinct perspective, such that listeners can follow the line of reasoning, alternative or opposing perspectives are addressed, and the organization, development, substance, and style are appropriate to purpose, audience, and a range of formal and informal tasks."},{"code":"ELA/SL.11-12.3","title":"3","desc":"Evaluate a speaker’s point of view, reasoning, and use of evidence and rhetoric, assessing the stance, premises, links among ideas, word choice, points of emphasis, and tone used."},{"code":"ELA/SL.11-12.2","title":"2","desc":"Integrate multiple sources of information presented in diverse formats and media (e.g., visually, quantitatively, orally) in order to make informed decisions and solve problems, evaluating the credibility and accuracy of each source and noting any discrepancies among the data."},{"code":"ELA/SL.11-12.1","title":"1","desc":"Initiate and participate effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grades 11-12 topics, texts, and issues, building on others’ ideas and expressing their own clearly and persuasively."},{"code":"ELA/SL.11-12.1.d","title":"d","desc":"Respond thoughtfully to diverse perspectives; synthesize comments, claims, and evidence made on all sides of an issue; resolve contradictions when possible; and determine what additional information or research is required to deepen the investigation or complete the task."},{"code":"ELA/SL.11-12.1.c","title":"c","desc":"Propel conversations by posing and responding to questions that probe reasoning and evidence; ensure a hearing for a full range of positions on a topic or issue; clarify, verify, or challenge ideas and conclusions; and promote divergent and creative perspectives."},{"code":"ELA/SL.11-12.1.b","title":"b","desc":"Work with peers to promote civil, democratic discussions and decision-making, set clear goals and deadlines, and establish individual roles as needed."},{"code":"ELA/SL.11-12.1.a","title":"a","desc":"Come to discussions prepared, having read and researched material under study; explicitly draw on that preparation by referring to evidence from texts and other research on the topic or issue to stimulate a thoughtful, well-reasoned exchange of ideas."},{"code":"ELA/SL.9-10","title":"Grade 9-10"},{"code":"ELA/SL.9-10.6","title":"6","desc":"Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate. (See grades 9-10 Language standards 1 and 3"},{"code":"ELA/SL.9-10.5","title":"5","desc":"Make strategic use of digital media (e.g., textual, graphical, audio, visual, and interactive elements) in presentations to enhance understanding of findings, reasoning, and evidence and to add interest."},{"code":"ELA/SL.9-10.4","title":"4","desc":"Present information, findings, and supporting evidence clearly, concisely, and logically such that listeners can follow the line of reasoning and the organization, development, substance, and style are appropriate to purpose, audience, and task."},{"code":"ELA/SL.9-10.3","title":"3","desc":"Evaluate a speaker’s point of view, reasoning, and use of evidence and rhetoric, identifying any fallacious reasoning or exaggerated or distorted evidence."},{"code":"ELA/SL.9-10.2","title":"2","desc":"Integrate multiple sources of information presented in diverse media or formats (e.g., visually, quantitatively, orally) evaluating the credibility and accuracy of each source."},{"code":"ELA/SL.9-10.1","title":"1","desc":"Initiate and participate effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grades 9-10 topics, texts, and issues, building on others’ ideas and expressing their own clearly and persuasively."},{"code":"ELA/SL.9-10.1.d","title":"d","desc":"Respond thoughtfully to diverse perspectives, summarize points of agreement and disagreement, and, when warranted, qualify or justify their own views and understanding and make new connections in light of the evidence and reasoning presented."},{"code":"ELA/SL.9-10.1.c","title":"c","desc":"Propel conversations by posing and responding to questions that relate the current discussion to broader themes or larger ideas; actively incorporate others into the discussion; and clarify, verify, or challenge ideas and conclusions."},{"code":"ELA/SL.9-10.1.b","title":"b","desc":"Work with peers to set rules for collegial discussions and decision-making (e.g., informal consensus, taking votes on key issues, presentation of alternate views), clear goals and deadlines, and individual roles as needed."},{"code":"ELA/SL.9-10.1.a","title":"a","desc":"Come to discussions prepared, having read and researched material under study; explicitly draw on that preparation by referring to evidence from texts and other research on the topic or issue to stimulate a thoughtful, well-reasoned exchange of ideas."},{"code":"ELA/SL.K","title":"Kindergarten"},{"code":"ELA/SL.K.6","title":"6","desc":"Speak audibly and express thoughts, feelings, and ideas clearly."},{"code":"ELA/SL.K.5","title":"5","desc":"Add drawings or other visual displays to descriptions as desired to provide additional detail."},{"code":"ELA/SL.K.4","title":"4","desc":"Describe familiar people, places, things, and events and, with prompting and support, provide additional detail."},{"code":"ELA/SL.K.3","title":"3","desc":"Ask and answer questions in order to seek help, get information, or clarify something that is not understood."},{"code":"ELA/SL.K.2","title":"2","desc":"Confirm understanding of a text read aloud or information presented orally or through other media by asking and answering questions about key details and requesting clarification if something is not understood."},{"code":"ELA/SL.K.1","title":"1","desc":"Participate in collaborative conversations with diverse partners about"},{"code":"ELA/SL.K.1.b","title":"b","desc":"Continue a conversation through multiple exchanges."},{"code":"ELA/SL.K.1.a","title":"a","desc":"Follow agreed-upon rules for discussions (e.g., listening to others and taking turns speaking about the topics and texts under discussion)."},{"code":"ELA/SL.8","title":"Grade 8"},{"code":"ELA/SL.8.6","title":"6","desc":"Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate. (See grade 8 Language standards 1 and 3"},{"code":"ELA/SL.8.5","title":"5","desc":"Integrate multimedia and visual displays into presentations to clarify information, strengthen claims and evidence, and add interest."},{"code":"ELA/SL.8.4","title":"4","desc":"Present claims and findings, emphasizing salient points in a focused, coherent manner with relevant evidence, sound valid reasoning, and well-chosen details; use appropriate eye contact, adequate volume, and clear pronunciation."},{"code":"ELA/SL.8.3","title":"3","desc":"Delineate a speaker’s argument and specific claims, evaluating the soundness of the reasoning and relevance and sufficiency of the evidence and identifying when irrelevant evidence is introduced."},{"code":"ELA/SL.8.2","title":"2","desc":"Analyze the purpose of information presented in diverse media and formats (e.g., visually, quantitatively, orally) and evaluate the motives (e.g., social, commercial, political) behind its presentation."},{"code":"ELA/SL.8.1","title":"1","desc":"Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grade 8 topics, texts, and issues, building on others’ ideas and expressing their own clearly."},{"code":"ELA/SL.8.1.d","title":"d","desc":"Acknowledge new information expressed by others, and, when warranted, qualify or justify their own views in light of the evidence presented."},{"code":"ELA/SL.8.1.c","title":"c","desc":"Pose questions that connect the ideas of several speakers and respond to others’ questions and comments with relevant evidence, observations, and ideas."},{"code":"ELA/SL.8.1.b","title":"b","desc":"Follow rules for collegial discussions and decision-making, track progress toward specific goals and deadlines, and define individual roles as needed."},{"code":"ELA/SL.8.1.a","title":"a","desc":"Come to discussions prepared, having read or researched material under study; explicitly draw on that preparation by referring to evidence on the topic, text, or issue to probe and reflect on ideas under discussion."},{"code":"ELA/SL.7","title":"Grade 7"},{"code":"ELA/SL.7.6","title":"6","desc":"Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate. (See grade 7 Language standards 1 and 3"},{"code":"ELA/SL.7.5","title":"5","desc":"Include multimedia components and visual displays in presentations to clarify claims and findings and emphasize salient points."},{"code":"ELA/SL.7.4","title":"4","desc":"Present claims and findings, emphasizing salient points in a focused, coherent manner with pertinent descriptions, facts, details, and examples; use appropriate eye contact, adequate volume, and clear pronunciation."},{"code":"ELA/SL.7.3","title":"3","desc":"Delineate a speaker’s argument and specific claims, evaluating the soundness of the reasoning and the relevance and sufficiency of the evidence."},{"code":"ELA/SL.7.2","title":"2","desc":"Analyze the main ideas and supporting details presented in diverse media and formats (e.g., visually, quantitatively, orally) and explain how the ideas clarify a topic, text, or issue under study."},{"code":"ELA/SL.7.1","title":"1","desc":"Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grade 7 topics, texts, and issues, building on others’ ideas and expressing their own clearly."},{"code":"ELA/SL.7.1.d","title":"d","desc":"Acknowledge new information expressed by others and, when warranted, modify their own views."},{"code":"ELA/SL.7.1.c","title":"c","desc":"Pose questions that elicit elaboration and respond to others’ questions and comments with relevant observations and ideas that bring the discussion back on topic as needed."},{"code":"ELA/SL.7.1.b","title":"b","desc":"Follow rules for collegial discussions, track progress toward specific goals and deadlines, and define individual roles as needed."},{"code":"ELA/SL.7.1.a","title":"a","desc":"Come to discussions prepared, having read or researched material under study; explicitly draw on that preparation by referring to evidence on the topic, text, or issue to probe and reflect on ideas under discussion."},{"code":"ELA/SL.6","title":"Grade 6"},{"code":"ELA/SL.6.6","title":"6","desc":"Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate. (See grade 6 Language standards 1 and 3"},{"code":"ELA/SL.6.5","title":"5","desc":"Include multimedia components (e.g., graphics, images, music, sound) and visual displays in presentations to clarify information."},{"code":"ELA/SL.6.4","title":"4","desc":"Present claims and findings, sequencing ideas logically and using pertinent descriptions, facts, and details to accentuate main ideas or themes; use appropriate eye contact, adequate volume, and clear pronunciation."},{"code":"ELA/SL.6.3","title":"3","desc":"Delineate a speaker’s argument and specific claims, distinguishing claims that are supported by reasons and evidence from claims that are not."},{"code":"ELA/SL.6.2","title":"2","desc":"Interpret information presented in diverse media and formats (e.g., visually, quantitatively, orally) and explain how it contributes to a topic, text, or issue under study."},{"code":"ELA/SL.6.1","title":"1","desc":"Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grade 6 topics, texts, and issues, building on others’ ideas and expressing their own clearly."},{"code":"ELA/SL.6.1.d","title":"d","desc":"Review the key ideas expressed and demonstrate understanding of multiple perspectives through reflection and paraphrasing."},{"code":"ELA/SL.6.1.c","title":"c","desc":"Pose and respond to specific questions with elaboration and detail by making comments that contribute to the topic, text, or issue under discussion."},{"code":"ELA/SL.6.1.b","title":"b","desc":"Follow rules for collegial discussions, set specific goals and deadlines, and define individual roles as needed."},{"code":"ELA/SL.6.1.a","title":"a","desc":"Come to discussions prepared, having read or studied required material; explicitly draw on that preparation by referring to evidence on the topic, text, or issue to probe and reflect on ideas under discussion."},{"code":"ELA/SL.5","title":"Grade 5"},{"code":"ELA/SL.5.6","title":"6","desc":"Adapt speech to a variety of contexts and tasks, using formal English when appropriate to task and situation. (See grade 5 Language standards 1 and\n3"},{"code":"ELA/SL.5.5","title":"5","desc":"Include multimedia components (e.g., graphics, sound) and visual displays in presentations when appropriate to enhance the development of main ideas or themes."},{"code":"ELA/SL.5.4","title":"4","desc":"Report on a topic or text or present an opinion, sequencing ideas logically and using appropriate facts and relevant, descriptive details to support main ideas or themes; speak clearly at an understandable pace."},{"code":"ELA/SL.5.3","title":"3","desc":"Summarize the points a speaker makes and explain how each claim is supported by reasons and evidence."},{"code":"ELA/SL.5.2","title":"2","desc":"Summarize a written text read aloud or information presented in diverse media and formats, including visually, quantitatively, and orally."},{"code":"ELA/SL.5.1","title":"1","desc":"Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on"},{"code":"ELA/SL.5.1.d","title":"d","desc":"Review the key ideas expressed and draw conclusions in light of information and knowledge gained from the discussions."},{"code":"ELA/SL.5.1.c","title":"c","desc":"Pose and respond to specific questions by making comments that contribute to the discussion and elaborate on the remarks of others."},{"code":"ELA/SL.5.1.b","title":"b","desc":"Follow agreed-upon rules for discussions and carry out assigned roles."},{"code":"ELA/SL.5.1.a","title":"a","desc":"Come to discussions prepared, having read or studied required material; explicitly draw on that preparation and other information known about the topic to explore ideas under discussion."},{"code":"ELA/SL.4","title":"Grade 4"},{"code":"ELA/SL.4.6","title":"6","desc":"Differentiate between contexts that call for formal English (e.g., presenting ideas) and situations where informal discourse is appropriate (e.g., small-group discussion); use formal English when appropriate to task and situation. (See grade 4 Language standards 1"},{"code":"ELA/SL.4.5","title":"5","desc":"Add audio recordings and visual displays to presentations when appropriate to enhance the development of main ideas or themes."},{"code":"ELA/SL.4.4","title":"4","desc":"Report on a topic or text, tell a story, or recount an experience in an organized manner, using appropriate facts and relevant, descriptive details to support main ideas or themes; speak clearly at an understandable pace."},{"code":"ELA/SL.4.3","title":"3","desc":"Identify the reasons and evidence a speaker provides to support particular points."},{"code":"ELA/SL.4.2","title":"2","desc":"Paraphrase portions of a text read aloud or information presented in diverse media and formats, including visually, quantitatively, and orally."},{"code":"ELA/SL.4.1","title":"1","desc":"Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on"},{"code":"ELA/SL.4.1.d","title":"d","desc":"Review the key ideas expressed and explain their own ideas and understanding in light of the discussion."},{"code":"ELA/SL.4.1.c","title":"c","desc":"Pose and respond to specific questions to clarify or follow up on information, and make comments that contribute to the discussion and link to the remarks of others."},{"code":"ELA/SL.4.1.b","title":"b","desc":"Follow agreed-upon rules for discussions and carry out assigned roles."},{"code":"ELA/SL.4.1.a","title":"a","desc":"Come to discussions prepared, having read or studied required material; explicitly draw on that preparation and other information known about the topic to explore ideas under discussion."},{"code":"ELA/SL.3","title":"Grade 3"},{"code":"ELA/SL.3.6","title":"6","desc":"Speak in complete sentences when appropriate to task and situation in order to provide requested detail or clarification. (See grade 3 Language standards 1 and 3"},{"code":"ELA/SL.3.5","title":"5","desc":"Create engaging audio recordings of stories or poems that demonstrate fluid reading at an understandable pace; add visual displays when appropriate to emphasize or enhance certain facts or details."},{"code":"ELA/SL.3.4","title":"4","desc":"Report on a topic or text, tell a story, or recount an experience with appropriate facts and relevant, descriptive details, speaking clearly at an understandable pace."},{"code":"ELA/SL.3.3","title":"3","desc":"Ask and answer questions about information from a speaker, offering appropriate elaboration and detail."},{"code":"ELA/SL.3.2","title":"2","desc":"Determine the main ideas and supporting details of a text read aloud or information presented in diverse media and formats, including visually, quantitatively, and orally."},{"code":"ELA/SL.3.1","title":"1","desc":"Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on"},{"code":"ELA/SL.3.1.d","title":"d","desc":"Explain their own ideas and understanding in light of the discussion."},{"code":"ELA/SL.3.1.c","title":"c","desc":"Ask questions to check understanding of information presented, stay on topic, and link their comments to the remarks of others."},{"code":"ELA/SL.3.1.b","title":"b","desc":"Follow agreed-upon rules for discussions (e.g., gaining the floor in respectful ways, listening to others with care, speaking one at a time about the topics and texts under discussion)."},{"code":"ELA/SL.3.1.a","title":"a","desc":"Come to discussions prepared, having read or studied required material; explicitly draw on that preparation and other information known about the topic to explore ideas under discussion."},{"code":"ELA/SL.2","title":"Grade 2"},{"code":"ELA/SL.2.6","title":"6","desc":"Produce complete sentences when appropriate to task and situation in order to provide requested detail or clarification. (See grade 2 Language standards 1 and 3"},{"code":"ELA/SL.2.5","title":"5","desc":"Create audio recordings of stories or poems; add drawings or other visual displays to stories or recounts of experiences when appropriate to clarify ideas, thoughts, and feelings."},{"code":"ELA/SL.2.4","title":"4","desc":"Tell a story or recount an experience with appropriate facts and relevant, descriptive details, speaking audibly in coherent sentences."},{"code":"ELA/SL.2.3","title":"3","desc":"Ask and answer questions about what a speaker says in order to clarify comprehension, gather additional information, or deepen understanding of a topic or issue."},{"code":"ELA/SL.2.2","title":"2","desc":"Recount or describe key ideas or details from a text read aloud or information presented orally or through other media."},{"code":"ELA/SL.2.1","title":"1","desc":"Participate in collaborative conversations with diverse partners about"},{"code":"ELA/SL.2.1.c","title":"c","desc":"Ask for clarification and further explanation as needed about the topics and texts under discussion."},{"code":"ELA/SL.2.1.b","title":"b","desc":"Build on others’ talk in conversations by linking their comments to the remarks of others."},{"code":"ELA/SL.2.1.a","title":"a","desc":"Follow agreed-upon rules for discussions (e.g., gaining the floor in respectful ways, listening to others with care, speaking one at a time about the topics and texts under discussion)."},{"code":"ELA/SL.1","title":"Grade 1"},{"code":"ELA/SL.1.6","title":"6","desc":"Produce complete sentences when appropriate to task and situation. (See grade 1 Language standards 1 and 3"},{"code":"ELA/SL.1.5","title":"5","desc":"Add drawings or other visual displays to descriptions when appropriate to clarify ideas, thoughts, and feelings."},{"code":"ELA/SL.1.4","title":"4","desc":"Describe people, places, things, and events with relevant details, expressing ideas and feelings clearly."},{"code":"ELA/SL.1.3","title":"3","desc":"Ask and answer questions about what a speaker says in order to gather additional information or clarify something that is not understood."},{"code":"ELA/SL.1.2","title":"2","desc":"Ask and answer questions about key details in a text read aloud or information presented orally or through other media."},{"code":"ELA/SL.1.1","title":"1","desc":"Participate in collaborative conversations with diverse partners about"},{"code":"ELA/SL.1.1.c","title":"c","desc":"Ask questions to clear up any confusion about the topics and texts under discussion."},{"code":"ELA/SL.1.1.b","title":"b","desc":"Build on others’ talk in conversations by responding to the comments of others through multiple exchanges."},{"code":"ELA/SL.1.1.a","title":"a","desc":"Follow agreed-upon rules for discussions (e.g., listening to others with care, speaking one at a time about the topics and texts under discussion)."},{"code":"ELA/RST","title":"Science & Technical Subjects"},{"code":"ELA/RST.11-12","title":"Grade 11-12"},{"code":"ELA/RST.11-12.10","title":"10","desc":"By the end of grade 12, read and comprehend science/technical texts in the grades 11-CCR text complexity band independently and proficiently."},{"code":"ELA/RST.11-12.9","title":"9","desc":"Synthesize information from a range of sources (e.g., texts, experiments, simulations) into a coherent understanding of a process, phenomenon, or concept, resolving conflicting information when possible."},{"code":"ELA/RST.11-12.8","title":"8","desc":"Evaluate the hypotheses, data, analysis, and conclusions in a science or technical text, verifying the data when possible and corroborating or challenging conclusions with other sources of information."},{"code":"ELA/RST.11-12.7","title":"7","desc":"Integrate and evaluate multiple sources of information presented in diverse formats and media (e.g., quantitative data, video, multimedia) in order to address a question or solve a problem."},{"code":"ELA/RST.11-12.6","title":"6","desc":"Analyze the author’s purpose in providing an explanation, describing a procedure, or discussing an experiment in a text, identifying important issues that remain unresolved."},{"code":"ELA/RST.11-12.5","title":"5","desc":"Analyze how the text structures information or ideas into categories or hierarchies, demonstrating understanding of the information or ideas."},{"code":"ELA/RST.11-12.4","title":"4","desc":"Determine the meaning of symbols, key terms, and other domain-specific words and phrases as they are used in a specific scientific or technical context relevant to"},{"code":"ELA/RST.11-12.3","title":"3","desc":"Follow precisely a complex multistep procedure when carrying out experiments, taking measurements, or performing technical tasks; analyze the specific results based on explanations in the text."},{"code":"ELA/RST.11-12.2","title":"2","desc":"Determine the central ideas or conclusions of a text; summarize complex concepts, processes, or information presented in a text by paraphrasing them in simpler but still accurate terms."},{"code":"ELA/RST.11-12.1","title":"1","desc":"Cite specific textual evidence to support analysis of science and technical texts, attending to important distinctions the author makes and to any gaps or inconsistencies in the account."},{"code":"ELA/RST.9-10","title":"Grade 9-10"},{"code":"ELA/RST.9-10.10","title":"10","desc":"By the end of grade 10, read and comprehend science/technical texts in the grades 9-10 text complexity band independently and proficiently."},{"code":"ELA/RST.9-10.9","title":"9","desc":"Compare and contrast findings presented in a text to those from other sources (including their own experiments), noting when the findings support or contradict previous explanations or accounts."},{"code":"ELA/RST.9-10.8","title":"8","desc":"Assess the extent to which the reasoning and evidence in a text support the author’s claim or a recommendation for solving a scientific or technical problem."},{"code":"ELA/RST.9-10.7","title":"7","desc":"Translate quantitative or technical information expressed in words in a text into visual form (e.g., a table or chart) and translate information expressed visually or mathematically (e.g., in an equation) into words."},{"code":"ELA/RST.9-10.6","title":"6","desc":"Analyze the author’s purpose in providing an explanation, describing a procedure, or discussing an experiment in a text, defining the question the author seeks to address."},{"code":"ELA/RST.9-10.5","title":"5","desc":"Analyze the structure of the relationships among concepts in a text, including relationships among key terms (e.g.,"},{"code":"ELA/RST.9-10.4","title":"4","desc":"Determine the meaning of symbols, key terms, and other domain-specific words and phrases as they are used in a specific scientific or technical context relevant to"},{"code":"ELA/RST.9-10.3","title":"3","desc":"Follow precisely a complex multistep procedure when carrying out experiments, taking measurements, or performing technical tasks, attending to special cases or exceptions defined in the text."},{"code":"ELA/RST.9-10.2","title":"2","desc":"Determine the central ideas or conclusions of a text; trace the text’s explanation or depiction of a complex process, phenomenon, or concept; provide an accurate summary of the text."},{"code":"ELA/RST.9-10.1","title":"1","desc":"Cite specific textual evidence to support analysis of science and technical texts, attending to the precise details of explanations or descriptions."},{"code":"ELA/RST.6-8","title":"Grade 6-8"},{"code":"ELA/RST.6-8.10","title":"10","desc":"By the end of grade 8, read and comprehend science/technical texts in the grades 6-8 text complexity band independently and proficiently."},{"code":"ELA/RST.6-8.9","title":"9","desc":"Compare and contrast the information gained from experiments, simulations, video, or multimedia sources with that gained from reading a text on the same topic."},{"code":"ELA/RST.6-8.8","title":"8","desc":"Distinguish among facts, reasoned judgment based on research findings, and speculation in a text."},{"code":"ELA/RST.6-8.7","title":"7","desc":"Integrate quantitative or technical information expressed in words in a text with a version of that information expressed visually (e.g., in a flowchart, diagram, model, graph, or table)."},{"code":"ELA/RST.6-8.6","title":"6","desc":"Analyze the author’s purpose in providing an explanation, describing a procedure, or discussing an experiment in a text."},{"code":"ELA/RST.6-8.5","title":"5","desc":"Analyze the structure an author uses to organize a text, including how the major sections contribute to the whole and to an understanding of the topic."},{"code":"ELA/RST.6-8.4","title":"4","desc":"Determine the meaning of symbols, key terms, and other domain-specific words and phrases as they are used in a specific scientific or technical context relevant to"},{"code":"ELA/RST.6-8.3","title":"3","desc":"Follow precisely a multistep procedure when carrying out experiments, taking measurements, or performing technical tasks."},{"code":"ELA/RST.6-8.2","title":"2","desc":"Determine the central ideas or conclusions of a text; provide an accurate summary of the text distinct from prior knowledge or opinions."},{"code":"ELA/RST.6-8.1","title":"1","desc":"Cite specific textual evidence to support analysis of science and technical texts."},{"code":"ELA/RL","title":"Reading: Literature"},{"code":"ELA/RL.11-12","title":"Grade 11-12"},{"code":"ELA/RL.11-12.10","title":"10","desc":"By the end of grade 11, read and comprehend literature, including stories, dramas, and poems, in the grades 11-CCR text complexity band proficiently, with scaffolding as needed at the high end of the range."},{"code":"ELA/RL.11-12.9","title":"9","desc":"Demonstrate knowledge of eighteenth-, nineteenth- and early-twentieth-century foundational works of American literature, including how two or more texts from the same period treat similar themes or topics."},{"code":"ELA/RL.11-12.8","title":"8","desc":"(RL.11-12.8 not applicable to literature)"},{"code":"ELA/RL.11-12.7","title":"7","desc":"Analyze multiple interpretations of a story, drama, or poem (e.g., recorded or live production of a play or recorded novel or poetry), evaluating how each version interprets the source text. (Include at least one play by Shakespeare and one play by an American dramatist.)"},{"code":"ELA/RL.11-12.6","title":"6","desc":"Analyze a case in which grasping a point of view requires distinguishing what is directly stated in a text from what is really meant (e.g., satire, sarcasm, irony, or understatement)."},{"code":"ELA/RL.11-12.5","title":"5","desc":"Analyze how an author’s choices concerning how to structure specific parts of a text (e.g., the choice of where to begin or end a story, the choice to provide a comedic or tragic resolution) contribute to its overall structure and meaning as well as its aesthetic impact."},{"code":"ELA/RL.11-12.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in the text, including figurative and connotative meanings; analyze the impact of specific word choices on meaning and tone, including words with multiple meanings or language that is particularly fresh, engaging, or beautiful. (Include Shakespeare as well as other authors.)"},{"code":"ELA/RL.11-12.3","title":"3","desc":"Analyze the impact of the author’s choices regarding how to develop and relate elements of a story or drama (e.g., where a story is set, how the action is ordered, how the characters are introduced and developed)."},{"code":"ELA/RL.11-12.2","title":"2","desc":"Determine two or more themes or central ideas of a text and analyze their development over the course of the text, including how they interact and build on one another to produce a complex account; provide an objective summary of the text."},{"code":"ELA/RL.11-12.1","title":"1","desc":"Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text, including determining where the text leaves matters uncertain."},{"code":"ELA/RL.9-10","title":"Grade 9-10"},{"code":"ELA/RL.9-10.10","title":"10","desc":"By the end of grade 9, read and comprehend literature, including stories, dramas, and poems, in the grades 9-10 text complexity band proficiently, with scaffolding as needed at the high end of the range."},{"code":"ELA/RL.9-10.9","title":"9","desc":"Analyze how an author draws on and transforms source material in a specific work (e.g., how Shakespeare treats a theme or topic from Ovid or the Bible or how a later author draws on a play by Shakespeare)."},{"code":"ELA/RL.9-10.8","title":"8","desc":"(RL.9-10.8 not applicable to literature)"},{"code":"ELA/RL.9-10.7","title":"7","desc":"Analyze the representation of a subject or a key scene in two different artistic mediums, including what is emphasized or absent in each treatment (e.g., Auden’s “Musée des Beaux Arts” and Breughel’s Landscape with the Fall of Icarus)."},{"code":"ELA/RL.9-10.6","title":"6","desc":"Analyze a particular point of view or cultural experience reflected in a work of literature from outside the United States, drawing on a wide reading of world literature."},{"code":"ELA/RL.9-10.5","title":"5","desc":"Analyze how an author’s choices concerning how to structure a text, order events within it (e.g., parallel plots), and manipulate time (e.g., pacing, flashbacks) create such effects as mystery, tension, or surprise."},{"code":"ELA/RL.9-10.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in the text, including figurative and connotative meanings; analyze the cumulative impact of specific word choices on meaning and tone (e.g., how the language evokes a sense of time and place; how it sets a formal or informal tone)."},{"code":"ELA/RL.9-10.3","title":"3","desc":"Analyze how complex characters (e.g., those with multiple or conflicting motivations) develop over the course of a text, interact with other characters, and advance the plot or develop the theme."},{"code":"ELA/RL.9-10.2","title":"2","desc":"Determine a theme or central idea of a text and analyze in detail its development over the course of the text, including how it emerges and is shaped and refined by specific details; provide an objective summary of the text."},{"code":"ELA/RL.9-10.1","title":"1","desc":"Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text."},{"code":"ELA/RL.K","title":"Kindergarten"},{"code":"ELA/RL.K.10","title":"10","desc":"Actively engage in group reading activities with purpose and understanding."},{"code":"ELA/RL.K.9","title":"9","desc":"With prompting and support, compare and contrast the adventures and experiences of characters in familiar stories."},{"code":"ELA/RL.K.8","title":"8","desc":"(RL.K.8 not applicable to literature)"},{"code":"ELA/RL.K.7","title":"7","desc":"With prompting and support, describe the relationship between illustrations and the story in which they appear (e.g., what moment in a story an illustration depicts)."},{"code":"ELA/RL.K.6","title":"6","desc":"With prompting and support, name the author and illustrator of a story and define the role of each in telling the story."},{"code":"ELA/RL.K.5","title":"5","desc":"Recognize common types of texts (e.g., storybooks, poems)."},{"code":"ELA/RL.K.4","title":"4","desc":"Ask and answer questions about unknown words in a text."},{"code":"ELA/RL.K.3","title":"3","desc":"With prompting and support, identify characters, settings, and major events in a story."},{"code":"ELA/RL.K.2","title":"2","desc":"With prompting and support, retell familiar stories, including key details."},{"code":"ELA/RL.K.1","title":"1","desc":"With prompting and support, ask and answer questions about key details in a text."},{"code":"ELA/RL.8","title":"Grade 8"},{"code":"ELA/RL.8.10","title":"10","desc":"By the end of the year, read and comprehend literature, including stories, dramas, and poems, at the high end of grades 6-8 text complexity band independently and proficiently."},{"code":"ELA/RL.8.9","title":"9","desc":"Analyze how a modern work of fiction draws on themes, patterns of events, or character types from myths, traditional stories, or religious works such as the Bible, including describing how the material is rendered new."},{"code":"ELA/RL.8.8","title":"8","desc":"(RL.8.8 not applicable to literature)"},{"code":"ELA/RL.8.7","title":"7","desc":"Analyze the extent to which a filmed or live production of a story or drama stays faithful to or departs from the text or script, evaluating the choices made by the director or actors."},{"code":"ELA/RL.8.6","title":"6","desc":"Analyze how differences in the points of view of the characters and the audience or reader (e.g., created through the use of dramatic irony) create such effects as suspense or humor."},{"code":"ELA/RL.8.5","title":"5","desc":"Compare and contrast the structure of two or more texts and analyze how the differing structure of each text contributes to its meaning and style."},{"code":"ELA/RL.8.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, including figurative and connotative meanings; analyze the impact of specific word choices on meaning and tone, including analogies or allusions to other texts."},{"code":"ELA/RL.8.3","title":"3","desc":"Analyze how particular lines of dialogue or incidents in a story or drama propel the action, reveal aspects of a character, or provoke a decision."},{"code":"ELA/RL.8.2","title":"2","desc":"Determine a theme or central idea of a text and analyze its development over the course of the text, including its relationship to the characters, setting, and plot; provide an objective summary of the text."},{"code":"ELA/RL.8.1","title":"1","desc":"Cite the textual evidence that most strongly supports an analysis of what the text says explicitly as well as inferences drawn from the text."},{"code":"ELA/RL.7","title":"Grade 7"},{"code":"ELA/RL.7.10","title":"10","desc":"By the end of the year, read and comprehend literature, including stories, dramas, and poems, in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range."},{"code":"ELA/RL.7.9","title":"9","desc":"Compare and contrast a fictional portrayal of a time, place, or character and a historical account of the same period as a means of understanding how authors of fiction use or alter history."},{"code":"ELA/RL.7.8","title":"8","desc":"(RL.7.8 not applicable to literature)"},{"code":"ELA/RL.7.7","title":"7","desc":"Compare and contrast a written story, drama, or poem to its audio, filmed, staged, or multimedia version, analyzing the effects of techniques unique to each medium (e.g., lighting, sound, color, or camera focus and angles in a film)."},{"code":"ELA/RL.7.6","title":"6","desc":"Analyze how an author develops and contrasts the points of view of different characters or narrators in a text."},{"code":"ELA/RL.7.5","title":"5","desc":"Analyze how a drama’s or poem’s form or structure (e.g., soliloquy, sonnet) contributes to its meaning"},{"code":"ELA/RL.7.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, including figurative and connotative meanings; analyze the impact of rhymes and other repetitions of sounds (e.g., alliteration) on a specific verse or stanza of a poem or section of a story or drama."},{"code":"ELA/RL.7.3","title":"3","desc":"Analyze how particular elements of a story or drama interact (e.g., how setting shapes the characters or plot)."},{"code":"ELA/RL.7.2","title":"2","desc":"Determine a theme or central idea of a text and analyze its development over the course of the text; provide an objective summary of the text."},{"code":"ELA/RL.7.1","title":"1","desc":"Cite several pieces of textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text."},{"code":"ELA/RL.6","title":"Grade 6"},{"code":"ELA/RL.6.10","title":"10","desc":"By the end of the year, read and comprehend literature, including stories, dramas, and poems, in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range."},{"code":"ELA/RL.6.9","title":"9","desc":"Compare and contrast texts in different forms or genres (e.g., stories and poems; historical novels and fantasy stories) in terms of their approaches to similar themes and topics."},{"code":"ELA/RL.6.8","title":"8","desc":"(RL.6.8 not applicable to literature)"},{"code":"ELA/RL.6.7","title":"7","desc":"Compare and contrast the experience of reading a story, drama, or poem to listening to or viewing an audio, video, or live version of the text, including contrasting what they “see” and “hear” when reading the text to what they perceive when they listen or watch."},{"code":"ELA/RL.6.6","title":"6","desc":"Explain how an author develops the point of view of the narrator or speaker in a text."},{"code":"ELA/RL.6.5","title":"5","desc":"Analyze how a particular sentence, chapter, scene, or stanza fits into the overall structure of a text and contributes to the development of the theme, setting, or plot."},{"code":"ELA/RL.6.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, including figurative and connotative meanings; analyze the impact of a specific word choice on meaning and tone"},{"code":"ELA/RL.6.3","title":"3","desc":"Describe how a particular story’s or drama’s plot unfolds in a series of episodes as well as how the characters respond or change as the plot moves toward a resolution."},{"code":"ELA/RL.6.2","title":"2","desc":"Determine a theme or central idea of a text and how it is conveyed through particular details; provide a summary of the text distinct from personal opinions or judgments."},{"code":"ELA/RL.6.1","title":"1","desc":"Cite textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text."},{"code":"ELA/RL.5","title":"Grade 5"},{"code":"ELA/RL.5.10","title":"10","desc":"By the end of the year, read and comprehend literature, including stories, dramas, and poetry, at the high end of the grades 4-5 text complexity band independently and proficiently."},{"code":"ELA/RL.5.9","title":"9","desc":"Compare and contrast stories in the same genre (e.g., mysteries and adventure stories) on their approaches to similar themes and topics."},{"code":"ELA/RL.5.8","title":"8","desc":"(RL.5.8 not applicable to literature)"},{"code":"ELA/RL.5.7","title":"7","desc":"Analyze how visual and multimedia elements contribute to the meaning, tone, or beauty of a text (e.g., graphic novel, multimedia presentation of fiction, folktale, myth, poem)."},{"code":"ELA/RL.5.6","title":"6","desc":"Describe how a narrator’s or speaker’s point of view influences how events are described."},{"code":"ELA/RL.5.5","title":"5","desc":"Explain how a series of chapters, scenes, or stanzas fits together to provide the overall structure of a particular story, drama, or poem."},{"code":"ELA/RL.5.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, including figurative language such as metaphors and similes."},{"code":"ELA/RL.5.3","title":"3","desc":"Compare and contrast two or more characters, settings, or events in a story or drama, drawing on specific details in the text (e.g., how characters interact)."},{"code":"ELA/RL.5.2","title":"2","desc":"Determine a theme of a story, drama, or poem from details in the text, including how characters in a story or drama respond to challenges or how the speaker in a poem reflects upon a topic; summarize the text."},{"code":"ELA/RL.5.1","title":"1","desc":"Quote accurately from a text when explaining what the text says explicitly and when drawing inferences from the text."},{"code":"ELA/RL.4","title":"Grade 4"},{"code":"ELA/RL.4.10","title":"10","desc":"By the end of the year, read and comprehend literature, including stories, dramas, and poetry, in the grades 4-5 text complexity band proficiently, with scaffolding as needed at the high end of the range."},{"code":"ELA/RL.4.9","title":"9","desc":"Compare and contrast the treatment of similar themes and topics (e.g., opposition of good and evil) and patterns of events (e.g., the quest) in stories, myths, and traditional literature from different cultures."},{"code":"ELA/RL.4.8","title":"8","desc":"(RL.4.8 not applicable to literature)"},{"code":"ELA/RL.4.7","title":"7","desc":"Make connections between the text of a story or drama and a visual or oral presentation of the text, identifying where each version reflects specific descriptions and directions in the text."},{"code":"ELA/RL.4.6","title":"6","desc":"Compare and contrast the point of view from which different stories are narrated, including the difference between first- and third-person narrations."},{"code":"ELA/RL.4.5","title":"5","desc":"Explain major differences between poems, drama, and prose, and refer to the structural elements of poems (e.g., verse, rhythm, meter) and drama (e.g., casts of characters, settings, descriptions, dialogue, stage directions) when writing or speaking about a text."},{"code":"ELA/RL.4.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, including those that allude to significant characters found in mythology (e.g., Herculean)."},{"code":"ELA/RL.4.3","title":"3","desc":"Describe in depth a character, setting, or event in a story or drama, drawing on specific details in the text (e.g., a character’s thoughts, words, or actions)."},{"code":"ELA/RL.4.2","title":"2","desc":"Determine a theme of a story, drama, or poem from details in the text; summarize the text."},{"code":"ELA/RL.4.1","title":"1","desc":"Refer to details and examples in a text when explaining what the text says explicitly and when drawing inferences from the text."},{"code":"ELA/RL.3","title":"Grade 3"},{"code":"ELA/RL.3.10","title":"10","desc":"By the end of the year, read and comprehend literature, including stories, dramas, and poetry, at the high end of the grades 2-3 text complexity band independently and proficiently."},{"code":"ELA/RL.3.9","title":"9","desc":"Compare and contrast the themes, settings, and plots of stories written by the same author about the same or similar characters (e.g., in books from a series)"},{"code":"ELA/RL.3.8","title":"8","desc":"(RL.3.8 not applicable to literature)"},{"code":"ELA/RL.3.7","title":"7","desc":"Explain how specific aspects of a text’s illustrations contribute to what is conveyed by the words in a story (e.g., create mood, emphasize aspects of a character or setting)"},{"code":"ELA/RL.3.6","title":"6","desc":"Distinguish their own point of view from that of the narrator or those of the characters."},{"code":"ELA/RL.3.5","title":"5","desc":"Refer to parts of stories, dramas, and poems when writing or speaking about a text, using terms such as chapter, scene, and stanza; describe how each successive part builds on earlier sections."},{"code":"ELA/RL.3.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, distinguishing literal from nonliteral language."},{"code":"ELA/RL.3.3","title":"3","desc":"Describe characters in a story (e.g., their traits, motivations, or feelings) and explain how their actions contribute to the sequence of events"},{"code":"ELA/RL.3.2","title":"2","desc":"Recount stories, including fables, folktales, and myths from diverse cultures; determine the central message, lesson, or moral and explain how it is conveyed through key details in the text."},{"code":"ELA/RL.3.1","title":"1","desc":"Ask and answer questions to demonstrate understanding of a text, referring explicitly to the text as the basis for the answers."},{"code":"ELA/RL.2","title":"Grade 2"},{"code":"ELA/RL.2.10","title":"10","desc":"By the end of the year, read and comprehend literature, including stories and poetry, in the grades 2-3 text complexity band proficiently, with scaffolding as needed at the high end of the range."},{"code":"ELA/RL.2.9","title":"9","desc":"Compare and contrast two or more versions of the same story (e.g., Cinderella stories) by different authors or from different cultures."},{"code":"ELA/RL.2.8","title":"8","desc":"(RL.2.8 not applicable to literature)"},{"code":"ELA/RL.2.7","title":"7","desc":"Use information gained from the illustrations and words in a print or digital text to demonstrate understanding of its characters, setting, or plot."},{"code":"ELA/RL.2.6","title":"6","desc":"Acknowledge differences in the points of view of characters, including by speaking in a different voice for each character when reading dialogue aloud."},{"code":"ELA/RL.2.5","title":"5","desc":"Describe the overall structure of a story, including describing how the beginning introduces the story and the ending concludes the action."},{"code":"ELA/RL.2.4","title":"4","desc":"Describe how words and phrases (e.g., regular beats, alliteration, rhymes, repeated lines) supply rhythm and meaning in a story, poem, or song."},{"code":"ELA/RL.2.3","title":"3","desc":"Describe how characters in a story respond to major events and challenges."},{"code":"ELA/RL.2.2","title":"2","desc":"Recount stories, including fables and folktales from diverse cultures, and determine their central message, lesson, or moral."},{"code":"ELA/RL.2.1","title":"1","desc":"Ask and answer such questions as"},{"code":"ELA/RL.1","title":"Grade 1"},{"code":"ELA/RL.1.10","title":"10","desc":"With prompting and support, read prose and poetry of appropriate complexity for grade 1."},{"code":"ELA/RL.1.9","title":"9","desc":"Compare and contrast the adventures and experiences of characters in stories."},{"code":"ELA/RL.1.8","title":"8","desc":"(RL.1.8 not applicable to literature)"},{"code":"ELA/RL.1.7","title":"7","desc":"Use illustrations and details in a story to describe its characters, setting, or events."},{"code":"ELA/RL.1.6","title":"6","desc":"Identify who is telling the story at various points in a text."},{"code":"ELA/RL.1.5","title":"5","desc":"Explain major differences between books that tell stories and books that give information, drawing on a wide reading of a range of text types."},{"code":"ELA/RL.1.4","title":"4","desc":"Identify words and phrases in stories or poems that suggest feelings or appeal to the senses."},{"code":"ELA/RL.1.3","title":"3","desc":"Describe characters, settings, and major events in a story, using key details."},{"code":"ELA/RL.1.2","title":"2","desc":"Retell stories, including key details, and demonstrate understanding of their central message or lesson."},{"code":"ELA/RL.1.1","title":"1","desc":"Ask and answer questions about key details in a text."},{"code":"ELA/RI","title":"Reading: Informational Text"},{"code":"ELA/RI.11-12","title":"Grade 11-12"},{"code":"ELA/RI.11-12.10","title":"10","desc":"By the end of grade 11, read and comprehend literary nonfiction in the grades 11-CCR text complexity band proficiently, with scaffolding as needed at the high end of the range."},{"code":"ELA/RI.11-12.9","title":"9","desc":"Analyze seventeenth-, eighteenth-, and nineteenth-century foundational U.S. documents of historical and literary significance (including The Declaration of Independence, the Preamble to the Constitution, the Bill of Rights, and Lincoln’s Second Inaugural Address) for their themes, purposes, and rhetorical features."},{"code":"ELA/RI.11-12.8","title":"8","desc":"Delineate and evaluate the reasoning in seminal U.S. texts, including the application of constitutional principles and use of legal reasoning (e.g., in U.S. Supreme Court majority opinions and dissents) and the premises, purposes, and arguments in works of public advocacy (e.g.,"},{"code":"ELA/RI.11-12.7","title":"7","desc":"Integrate and evaluate multiple sources of information presented in different media or formats (e.g., visually, quantitatively) as well as in words in order to address a question or solve a problem."},{"code":"ELA/RI.11-12.6","title":"6","desc":"Determine an author’s point of view or purpose in a text in which the rhetoric is particularly effective, analyzing how style and content contribute to the power, persuasiveness or beauty of the text."},{"code":"ELA/RI.11-12.5","title":"5","desc":"Analyze and evaluate the effectiveness of the structure an author uses in his or her exposition or argument, including whether the structure makes points clear, convincing, and engaging."},{"code":"ELA/RI.11-12.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings; analyze how an author uses and refines the meaning of a key term or terms over the course of a text (e.g., how Madison defines faction in Federalist No. 10)."},{"code":"ELA/RI.11-12.3","title":"3","desc":"Analyze a complex set of ideas or sequence of events and explain how specific individuals, ideas, or events interact and develop over the course of the text."},{"code":"ELA/RI.11-12.2","title":"2","desc":"Determine two or more central ideas of a text and analyze their development over the course of the text, including how they interact and build on one another to provide a complex analysis; provide an objective summary of the text."},{"code":"ELA/RI.11-12.1","title":"1","desc":"Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text, including determining where the text leaves matters uncertain."},{"code":"ELA/RI.9-10","title":"Grade 9-10"},{"code":"ELA/RI.9-10.10","title":"10","desc":"By the end of grade 9, read and comprehend literary nonfiction in the grades 9-10 text complexity band proficiently, with scaffolding as needed at the high end of the range."},{"code":"ELA/RI.9-10.9","title":"9","desc":"Analyze seminal U.S. documents of historical and literary significance  (e.g., Washington’s Farewell Address, the Gettysburg Address, Roosevelt’s Four Freedoms speech, King’s “Letter from Birmingham Jail”), including how they address related themes and concepts."},{"code":"ELA/RI.9-10.8","title":"8","desc":"Delineate and evaluate the argument and specific claims in a text, assessing whether the reasoning is valid and the evidence is relevant and sufficient; identify false statements and fallacious reasoning."},{"code":"ELA/RI.9-10.7","title":"7","desc":"Analyze various accounts of a subject told in different mediums (e.g., a person’s life story in both print and multimedia), determining which details are emphasized in each account."},{"code":"ELA/RI.9-10.6","title":"6","desc":"Determine an author’s point of view or purpose in a text and analyze how an author uses rhetoric to advance that point of view or purpose."},{"code":"ELA/RI.9-10.5","title":"5","desc":"Analyze in detail how an author’s ideas or claims are developed and refined by particular sentences, paragraphs, or larger portions of a text (e.g., a section or chapter)."},{"code":"ELA/RI.9-10.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings; analyze the cumulative impact of specific word choices on meaning and tone (e.g., how the language of a court opinion differs from that of a newspaper)."},{"code":"ELA/RI.9-10.3","title":"3","desc":"Analyze how the author unfolds an analysis or series of ideas or events, including the order in which the points are made, how they are introduced and developed, and the connections that are drawn between them."},{"code":"ELA/RI.9-10.2","title":"2","desc":"Determine a central idea of a text and analyze its development over the course of the text, including how it emerges and is shaped and refined by specific details; provide an objective summary of the text."},{"code":"ELA/RI.9-10.1","title":"1","desc":"Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text."},{"code":"ELA/RI.K","title":"Kindergarten"},{"code":"ELA/RI.K.10","title":"10","desc":"Actively engage in group reading activities with purpose and understanding."},{"code":"ELA/RI.K.9","title":"9","desc":"With prompting and support, identify basic similarities in and differences between two texts on the same topic (e.g., in illustrations, descriptions, or procedures)."},{"code":"ELA/RI.K.8","title":"8","desc":"With prompting and support, identify the reasons an author gives to support points in a text."},{"code":"ELA/RI.K.7","title":"7","desc":"With prompting and support, describe the relationship between illustrations and the text in which they appear (e.g., what person, place, thing, or idea in the text an illustration depicts)."},{"code":"ELA/RI.K.6","title":"6","desc":"Name the author and illustrator of a text and define the role of each in presenting the ideas or information in a text."},{"code":"ELA/RI.K.5","title":"5","desc":"Identify the front cover, back cover, and title page of a book."},{"code":"ELA/RI.K.4","title":"4","desc":"With prompting and support, ask and answer questions about unknown words in a text."},{"code":"ELA/RI.K.3","title":"3","desc":"With prompting and support, describe the connection between two individuals, events, ideas, or pieces of information in a text."},{"code":"ELA/RI.K.2","title":"2","desc":"With prompting and support, identify the main topic and retell key details of a text."},{"code":"ELA/RI.K.1","title":"1","desc":"With prompting and support, ask and answer questions about key details in a text."},{"code":"ELA/RI.8","title":"Grade 8"},{"code":"ELA/RI.8.10","title":"10","desc":"By the end of the year, read and comprehend literary nonfiction at the high end of the grades 6-8 text complexity band independently and proficiently."},{"code":"ELA/RI.8.9","title":"9","desc":"Analyze a case in which two or more texts provide conflicting information on the same topic and identify where the texts disagree on matters of fact or interpretation."},{"code":"ELA/RI.8.8","title":"8","desc":"Delineate and evaluate the argument and specific claims in a text, assessing whether the reasoning is sound and the evidence is relevant and sufficient; recognize when irrelevant evidence is introduced."},{"code":"ELA/RI.8.7","title":"7","desc":"Evaluate the advantages and disadvantages of using different mediums (e.g., print or digital text, video, multimedia) to present a particular topic or idea."},{"code":"ELA/RI.8.6","title":"6","desc":"Determine an author’s point of view or purpose in a text and analyze how the author acknowledges and responds to conflicting evidence or viewpoints."},{"code":"ELA/RI.8.5","title":"5","desc":"Analyze in detail the structure of a specific paragraph in a text, including the role of particular sentences in developing and refining a key concept."},{"code":"ELA/RI.8.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings; analyze the impact of specific word choices on meaning and tone, including analogies or allusions to other texts."},{"code":"ELA/RI.8.3","title":"3","desc":"Analyze how a text makes connections among and distinctions between individuals, ideas, or events (e.g., through comparisons, analogies, or categories)."},{"code":"ELA/RI.8.2","title":"2","desc":"Determine a central idea of a text and analyze its development over the course of the text, including its relationship to supporting ideas; provide an objective summary of the text."},{"code":"ELA/RI.8.1","title":"1","desc":"Cite the textual evidence that most strongly supports an analysis of what the text says explicitly as well as inferences drawn from the text."},{"code":"ELA/RI.7","title":"Grade 7"},{"code":"ELA/RI.7.10","title":"10","desc":"By the end of the year, read and comprehend literary nonfiction in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range."},{"code":"ELA/RI.7.9","title":"9","desc":"Analyze how two or more authors writing about the same topic shape their presentations of key information by emphasizing different evidence or advancing different interpretations of facts."},{"code":"ELA/RI.7.8","title":"8","desc":"Trace and evaluate the argument and specific claims in a text, assessing whether the reasoning is sound and the evidence is relevant and sufficient to support the claims."},{"code":"ELA/RI.7.7","title":"7","desc":"Compare and contrast a text to an audio, video, or multimedia version of the text, analyzing each medium’s portrayal of the subject (e.g., how the delivery of a speech affects the impact of the words)."},{"code":"ELA/RI.7.6","title":"6","desc":"Determine an author’s point of view or purpose in a text and analyze how the author distinguishes his or her position from that of others."},{"code":"ELA/RI.7.5","title":"5","desc":"Analyze the structure an author uses to organize a text, including how the major sections contribute to the whole and to the development of the ideas."},{"code":"ELA/RI.7.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings; analyze the impact of a specific word choice on meaning and tone."},{"code":"ELA/RI.7.3","title":"3","desc":"Analyze the interactions between individuals, events, and ideas in a text (e.g., how ideas influence individuals or events, or how individuals influence ideas or events)."},{"code":"ELA/RI.7.2","title":"2","desc":"Determine two or more central ideas in a text and analyze their development over the course of the text; provide an objective summary of the text."},{"code":"ELA/RI.7.1","title":"1","desc":"Cite several pieces of textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text."},{"code":"ELA/RI.6","title":"Grade 6"},{"code":"ELA/RI.6.10","title":"10","desc":"By the end of the year, read and comprehend literary nonfiction in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range."},{"code":"ELA/RI.6.9","title":"9","desc":"Compare and contrast one author’s presentation of events with that of another (e.g., a memoir written by and a biography on the same person)."},{"code":"ELA/RI.6.8","title":"8","desc":"Trace and evaluate the argument and specific claims in a text, distinguishing claims that are supported by reasons and evidence from claims that are not."},{"code":"ELA/RI.6.7","title":"7","desc":"Integrate information presented in different media or formats (e.g., visually, quantitatively) as well as in words to develop a coherent understanding of a topic or issue."},{"code":"ELA/RI.6.6","title":"6","desc":"Determine an author’s point of view or purpose in a text and explain how it is conveyed in the text."},{"code":"ELA/RI.6.5","title":"5","desc":"Analyze how a particular sentence, paragraph, chapter, or section fits into the overall structure of a text and contributes to the development of the ideas."},{"code":"ELA/RI.6.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings."},{"code":"ELA/RI.6.3","title":"3","desc":"Analyze in detail how a key individual, event, or idea is introduced, illustrated, and elaborated in a text (e.g., through examples or anecdotes)."},{"code":"ELA/RI.6.2","title":"2","desc":"Determine a central idea of a text and how it is conveyed through particular details; provide a summary of the text distinct from personal opinions or judgments."},{"code":"ELA/RI.6.1","title":"1","desc":"Cite textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text."},{"code":"ELA/RI.5","title":"Grade 5"},{"code":"ELA/RI.5.3","title":"3","desc":"Explain the relationships or interactions between two or more individuals, events, ideas, or concepts in a historical, scientific, or technical text based on specific information in the text."},{"code":"ELA/RI.5.1","title":"1","desc":"Quote accurately from a text when explaining what the text says explicitly and when drawing inferences from the text."},{"code":"ELA/RI.4","title":"Grade 4"},{"code":"ELA/RI.4.4","title":"4","desc":"Determine the meaning of general academic and domain-specific words or phrases in a text relevant to a"},{"code":"ELA/RI.3","title":"Grade 3"},{"code":"ELA/RI.3.1","title":"1","desc":"Ask and answer questions to demonstrate understanding of a text, referring explicitly to the text as the basis for the answers."},{"code":"ELA/RI.2","title":"Grade 2"},{"code":"ELA/RI.2.6","title":"6","desc":"Identify the main purpose of a text, including what the author wants to answer, explain, or describe."},{"code":"ELA/RI.2.5","title":"5","desc":"Know and use various text features (e.g., captions, bold print, subheadings, glossaries, indexes, electronic menus, icons) to locate key facts or information in a text efficiently."},{"code":"ELA/RI.2.4","title":"4","desc":"Determine the meaning of words and phrases in a text relevant to a"},{"code":"ELA/RI.2.3","title":"3","desc":"Describe the connection between a series of historical events, scientific ideas or concepts, or steps in technical procedures in a text."},{"code":"ELA/RI.2.2","title":"2","desc":"Identify the main topic of a multiparagraph text as well as the focus of specific paragraphs within the text."},{"code":"ELA/RI.2.1","title":"1","desc":"Ask and answer such questions as"},{"code":"ELA/RI.1","title":"Grade 1"},{"code":"ELA/RI.1.10","title":"10","desc":"With prompting and support, read informational texts appropriately complex for grade 1."},{"code":"ELA/RI.1.9","title":"9","desc":"Identify basic similarities in and differences between two texts on the same topic (e.g., in illustrations, descriptions, or procedures)."},{"code":"ELA/RI.1.8","title":"8","desc":"Identify the reasons an author gives to support points in a text."},{"code":"ELA/RI.1.7","title":"7","desc":"Use the illustrations and details in a text to describe its key ideas."},{"code":"ELA/RI.1.6","title":"6","desc":"Distinguish between information provided by pictures or other illustrations and information provided by the words in a text."},{"code":"ELA/RI.1.5","title":"5","desc":"Know and use various text features (e.g., headings, tables of contents, glossaries, electronic menus, icons) to locate key facts or information in a text."},{"code":"ELA/RI.1.4","title":"4","desc":"Ask and answer questions to help determine or clarify the meaning of words and phrases in a text."},{"code":"ELA/RI.1.3","title":"3","desc":"Describe the connection between two individuals, events, ideas, or pieces of information in a text."},{"code":"ELA/RI.1.2","title":"2","desc":"Identify the main topic and retell key details of a text."},{"code":"ELA/RI.1.1","title":"1","desc":"Ask and answer questions about key details in a text."},{"code":"ELA/RH","title":"History/Social Studies"},{"code":"ELA/RH.11-12","title":"Grade 11-12"},{"code":"ELA/RH.11-12.10","title":"10","desc":"By the end of grade 12, read and comprehend history/social studies texts in the grades 11-CCR text complexity band independently and proficiently."},{"code":"ELA/RH.11-12.9","title":"9","desc":"Integrate information from diverse sources, both primary and secondary, into a coherent understanding of an idea or event, noting discrepancies among sources."},{"code":"ELA/RH.11-12.8","title":"8","desc":"Evaluate an author’s premises, claims, and evidence by corroborating or challenging them with other information."},{"code":"ELA/RH.11-12.7","title":"7","desc":"Integrate and evaluate multiple sources of information presented in diverse formats and media (e.g., visually, quantitatively, as well as in words) in order to address a question or solve a problem."},{"code":"ELA/RH.11-12.6","title":"6","desc":"Evaluate authors’ differing points of view on the same historical event or issue by assessing the authors’ claims, reasoning, and evidence."},{"code":"ELA/RH.11-12.5","title":"5","desc":"Analyze in detail how a complex primary source is structured, including how key sentences, paragraphs, and larger portions of the text contribute to the whole."},{"code":"ELA/RH.11-12.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, including analyzing how an author uses and refines the meaning of a key term over the course of a text (e.g., how Madison defines"},{"code":"ELA/RH.11-12.3","title":"3","desc":"Evaluate various explanations for actions or events and determine which explanation best accords with textual evidence, acknowledging where the text leaves matters uncertain."},{"code":"ELA/RH.11-12.2","title":"2","desc":"Determine the central ideas or information of a primary or secondary source; provide an accurate summary that makes clear the relationships among the key details and ideas."},{"code":"ELA/RH.11-12.1","title":"1","desc":"Cite specific textual evidence to support analysis of primary and secondary sources, connecting insights gained from specific details to an understanding of the text as a whole."},{"code":"ELA/RH.9-10","title":"Grade 9-10"},{"code":"ELA/RH.9-10.10","title":"10","desc":"By the end of grade 10, read and comprehend history/social studies texts in the grades 9-10 text complexity band independently and proficiently."},{"code":"ELA/RH.9-10.9","title":"9","desc":"Compare and contrast treatments of the same topic in several primary and secondary sources."},{"code":"ELA/RH.9-10.8","title":"8","desc":"Assess the extent to which the reasoning and evidence in a text support the author’s claims."},{"code":"ELA/RH.9-10.7","title":"7","desc":"Integrate quantitative or technical analysis (e.g., charts, research data) with qualitative analysis in print or digital text."},{"code":"ELA/RH.9-10.6","title":"6","desc":"Compare the point of view of two or more authors for how they treat the same or similar topics, including which details they include and emphasize in their respective accounts."},{"code":"ELA/RH.9-10.5","title":"5","desc":"Analyze how a text uses structure to emphasize key points or advance an explanation or analysis."},{"code":"ELA/RH.9-10.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, including vocabulary describing political, social, or economic aspects of history/social science."},{"code":"ELA/RH.9-10.3","title":"3","desc":"Analyze in detail a series of events described in a text; determine whether earlier events caused later ones or simply preceded them."},{"code":"ELA/RH.9-10.2","title":"2","desc":"Determine the central ideas or information of a primary or secondary source; provide an accurate summary of how key events or ideas develop over the course of the text."},{"code":"ELA/RH.9-10.1","title":"1","desc":"Cite specific textual evidence to support analysis of primary and secondary sources, attending to such features as the date and origin of the information."},{"code":"ELA/RH.6-8","title":"Grade 6-8"},{"code":"ELA/RH.6-8.10","title":"10","desc":"By the end of grade 8, read and comprehend history/social studies texts in the grades 6-8 text complexity band independently and proficiently."},{"code":"ELA/RH.6-8.9","title":"9","desc":"Analyze the relationship between a primary and secondary source on the same topic."},{"code":"ELA/RH.6-8.8","title":"8","desc":"Distinguish among fact, opinion, and reasoned judgment in a text."},{"code":"ELA/RH.6-8.7","title":"7","desc":"Integrate visual information (e.g., in charts, graphs, photographs, videos, or maps) with other information in print and digital texts."},{"code":"ELA/RH.6-8.6","title":"6","desc":"Identify aspects of a text that reveal an author’s point of view or purpose (e.g., loaded language, inclusion or avoidance of particular facts)."},{"code":"ELA/RH.6-8.5","title":"5","desc":"Describe how a text presents information (e.g., sequentially, comparatively, causally)."},{"code":"ELA/RH.6-8.4","title":"4","desc":"Determine the meaning of words and phrases as they are used in a text, including vocabulary specific to domains related to history/social studies."},{"code":"ELA/RH.6-8.3","title":"3","desc":"Identify key steps in a text’s description of a process related to history/social studies (e.g., how a bill becomes law, how interest rates are raised or lowered)."},{"code":"ELA/RH.6-8.2","title":"2","desc":"Determine the central ideas or information of a primary or secondary source; provide an accurate summary of the source distinct from prior knowledge or opinions."},{"code":"ELA/RH.6-8.1","title":"1","desc":"Cite specific textual evidence to support analysis of primary and secondary sources."},{"code":"ELA/RF","title":"Reading: Foundational Skills"},{"code":"ELA/RF.K","title":"Kindergarten"},{"code":"ELA/RF.K.4","title":"4","desc":"Read emergent-reader texts with purpose and understanding."},{"code":"ELA/RF.K.3","title":"3","desc":"Know and apply grade-level phonics and word analysis skills in decoding words."},{"code":"ELA/RF.K.3.d","title":"d","desc":"Distinguish between similarly spelled words by identifying the sounds of the letters that differ."},{"code":"ELA/RF.K.3.c","title":"c","desc":"Read common high-frequency words by sight (e.g.,"},{"code":"ELA/RF.K.3.b","title":"b","desc":"Associate the long and short sounds with the common spellings (graphemes) for the five major vowels."},{"code":"ELA/RF.K.3.a","title":"a","desc":"Demonstrate basic knowledge of one-to-one letter-sound correspondences by producing the primary sound or many of the most frequent sounds for each consonant."},{"code":"ELA/RF.K.2","title":"2","desc":"Demonstrate understanding of spoken words, syllables, and sounds (phonemes)."},{"code":"ELA/RF.K.2.e","title":"e","desc":"Add or substitute individual sounds (phonemes) in simple, one-syllable words to make new words."},{"code":"ELA/RF.K.2.d","title":"d","desc":"Isolate and pronounce the initial, medial vowel, and final sounds (phonemes) in three-phoneme (consonant-vowel-consonant, or CVC) words."},{"code":"ELA/RF.K.2.c","title":"c","desc":"Blend and segment onsets and rimes of single-syllable spoken words."},{"code":"ELA/RF.K.2.b","title":"b","desc":"Count, pronounce, blend, and segment syllables in spoken words."},{"code":"ELA/RF.K.2.a","title":"a","desc":"Recognize and produce rhyming words."},{"code":"ELA/RF.K.1","title":"1","desc":"Demonstrate understanding of the organization and basic features of print."},{"code":"ELA/RF.K.1.d","title":"d","desc":"Recognize and name all upper- and lowercase letters of the alphabet."},{"code":"ELA/RF.K.1.c","title":"c","desc":"Understand that words are separated by spaces in print."},{"code":"ELA/RF.K.1.b","title":"b","desc":"Recognize that spoken words are represented in written language by specific sequences of letters."},{"code":"ELA/RF.K.1.a","title":"a","desc":"Follow words from left to right, top to bottom, and page by page."},{"code":"ELA/RF.5","title":"Grade 5"},{"code":"ELA/RF.5.4","title":"4","desc":"Read with sufficient accuracy and fluency to support comprehension."},{"code":"ELA/RF.5.4.c","title":"c","desc":"Use context to confirm or self-correct word recognition and understanding, rereading as necessary."},{"code":"ELA/RF.5.4.b","title":"b","desc":"Read grade-level prose and poetry orally with accuracy, appropriate rate, and expression on successive readings."},{"code":"ELA/RF.5.4.a","title":"a","desc":"Read grade-level text with purpose and understanding."},{"code":"ELA/RF.5.3","title":"3","desc":"Know and apply grade-level phonics and word analysis skills in decoding words."},{"code":"ELA/RF.5.3.a","title":"a","desc":"Use combined knowledge of all letter-sound correspondences, syllabication patterns, and morphology (e.g., roots and affixes) to read accurately unfamiliar multisyllabic words in context and out of context."},{"code":"ELA/RF.4","title":"Grade 4"},{"code":"ELA/RF.4.4","title":"4","desc":"Read with sufficient accuracy and fluency to support comprehension."},{"code":"ELA/RF.4.4.c","title":"c","desc":"Use context to confirm or self-correct word recognition and understanding, rereading as necessary."},{"code":"ELA/RF.4.4.b","title":"b","desc":"Read grade-level prose and poetry orally with accuracy, appropriate rate, and expression on successive readings."},{"code":"ELA/RF.4.4.a","title":"a","desc":"Read grade-level text with purpose and understanding."},{"code":"ELA/RF.4.3","title":"3","desc":"Know and apply grade-level phonics and word analysis skills in decoding words."},{"code":"ELA/RF.4.3.a","title":"a","desc":"Use combined knowledge of all letter-sound correspondences, syllabication patterns, and morphology (e.g., roots and affixes) to read accurately unfamiliar multisyllabic words in context and out of context."},{"code":"ELA/RF.3","title":"Grade 3"},{"code":"ELA/RF.3.4","title":"4","desc":"Read with sufficient accuracy and fluency to support comprehension."},{"code":"ELA/RF.3.4.c","title":"c","desc":"Use context to confirm or self-correct word recognition and understanding, rereading as necessary."},{"code":"ELA/RF.3.4.b","title":"b","desc":"Read grade-level prose and poetry orally with accuracy, appropriate rate, and expression on successive readings."},{"code":"ELA/RF.3.4.a","title":"a","desc":"Read grade-level text with purpose and understanding."},{"code":"ELA/RF.3.3","title":"3","desc":"Know and apply grade-level phonics and word analysis skills in decoding words."},{"code":"ELA/RF.3.3.d","title":"d","desc":"Read grade-appropriate irregularly spelled words."},{"code":"ELA/RF.3.3.c","title":"c","desc":"Decode multisyllable words."},{"code":"ELA/RF.3.3.b","title":"b","desc":"Decode words with common Latin suffixes."},{"code":"ELA/RF.3.3.a","title":"a","desc":"Identify and know the meaning of the most common prefixes and derivational suffixes."},{"code":"ELA/RF.2","title":"Grade 2"},{"code":"ELA/RF.2.4","title":"4","desc":"Read with sufficient accuracy and fluency to support comprehension."},{"code":"ELA/RF.2.4.c","title":"c","desc":"Use context to confirm or self-correct word recognition and understanding, rereading as necessary."},{"code":"ELA/RF.2.4.b","title":"b","desc":"Read grade-level text orally with accuracy, appropriate rate, and expression on successive readings."},{"code":"ELA/RF.2.4.a","title":"a","desc":"Read grade-level text with purpose and understanding."},{"code":"ELA/RF.2.3","title":"3","desc":"Know and apply grade-level phonics and word analysis skills in decoding words."},{"code":"ELA/RF.2.3.f","title":"f","desc":"Recognize and read grade-appropriate irregularly spelled words."},{"code":"ELA/RF.2.3.e","title":"e","desc":"Identify words with inconsistent but common spelling-sound correspondences."},{"code":"ELA/RF.2.3.d","title":"d","desc":"Decode words with common prefixes and suffixes."},{"code":"ELA/RF.2.3.c","title":"c","desc":"Decode regularly spelled two-syllable words with long vowels."},{"code":"ELA/RF.2.3.b","title":"b","desc":"Know spelling-sound correspondences for additional common vowel teams."},{"code":"ELA/RF.2.3.a","title":"a","desc":"Distinguish long and short vowels when reading regularly spelled one-syllable words."},{"code":"ELA/RF.1","title":"Grade 1"},{"code":"ELA/RF.1.4","title":"4","desc":"Read with sufficient accuracy and fluency to support comprehension."},{"code":"ELA/RF.1.4.c","title":"c","desc":"Use context to confirm or self-correct word recognition and understanding, rereading as necessary."},{"code":"ELA/RF.1.4.b","title":"b","desc":"Read grade-level text orally with accuracy, appropriate rate, and expression on successive readings."},{"code":"ELA/RF.1.4.a","title":"a","desc":"Read grade-level text with purpose and understanding."},{"code":"ELA/RF.1.3","title":"3","desc":"Know and apply grade-level phonics and word analysis skills in decoding words."},{"code":"ELA/RF.1.3.g","title":"g","desc":"Recognize and read grade-appropriate irregularly spelled words."},{"code":"ELA/RF.1.3.f","title":"f","desc":"Read words with inflectional endings."},{"code":"ELA/RF.1.3.e","title":"e","desc":"Decode two-syllable words following basic patterns by breaking the words into syllables."},{"code":"ELA/RF.1.3.d","title":"d","desc":"Use knowledge that every syllable must have a vowel sound to determine the number of syllables in a printed word."},{"code":"ELA/RF.1.3.c","title":"c","desc":"Know final -e and common vowel team conventions for representing long vowel sounds."},{"code":"ELA/RF.1.3.b","title":"b","desc":"Decode regularly spelled one-syllable words."},{"code":"ELA/RF.1.3.a","title":"a","desc":"Know the spelling-sound correspondences for common consonant digraphs."},{"code":"ELA/RF.1.2","title":"2","desc":"Demonstrate understanding of spoken words, syllables, and sounds (phonemes)."},{"code":"ELA/RF.1.2.d","title":"d","desc":"Segment spoken single-syllable words into their complete sequence of individual sounds (phonemes)."},{"code":"ELA/RF.1.2.c","title":"c","desc":"Isolate and pronounce initial, medial vowel, and final sounds (phonemes) in spoken single-syllable words."},{"code":"ELA/RF.1.2.b","title":"b","desc":"Orally produce single-syllable words by blending sounds (phonemes), including consonant blends."},{"code":"ELA/RF.1.2.a","title":"a","desc":"Distinguish long from short vowel sounds in spoken single-syllable words."},{"code":"ELA/RF.1.1","title":"1","desc":"Demonstrate understanding of the organization and basic features of print."},{"code":"ELA/RF.1.1.a","title":"a","desc":"Recognize the distinguishing features of a sentence (e.g., first word, capitalization, ending punctuation)."},{"code":"ELA/L","title":"Language"},{"code":"ELA/L.11-12","title":"Grade 11-12"},{"code":"ELA/L.11-12.6","title":"6","desc":"Acquire and use accurately general academic and domain-specific words and phrases, sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when considering a word or phrase important to comprehension or expression."},{"code":"ELA/L.11-12.5","title":"5","desc":"Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"code":"ELA/L.11-12.5.b","title":"b","desc":"Analyze nuances in the meaning of words with similar denotations."},{"code":"ELA/L.11-12.5.a","title":"a","desc":"Interpret figures of speech (e.g., hyperbole, paradox) in context and analyze their role in the text."},{"code":"ELA/L.11-12.4","title":"4","desc":"Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on"},{"code":"ELA/L.11-12.4.d","title":"d","desc":"Verify the preliminary determination of the meaning of a word or phrase (e.g., by checking the inferred meaning in context or in a dictionary)."},{"code":"ELA/L.11-12.4.c","title":"c","desc":"Consult general and specialized reference materials (e.g., dictionaries, glossaries, thesauruses), both print and digital, to find the pronunciation of a word or determine or clarify its precise meaning, its part of speech, its etymology, or its standard usage."},{"code":"ELA/L.11-12.4.b","title":"b","desc":"Identify and correctly use patterns of word changes that indicate different meanings or parts of speech (e.g.,"},{"code":"ELA/L.11-12.4.a","title":"a","desc":"Use context (e.g., the overall meaning of a sentence, paragraph, or text; a word’s position or function in a sentence) as a clue to the meaning of a word or phrase."},{"code":"ELA/L.11-12.3","title":"3","desc":"Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."},{"code":"ELA/L.11-12.3.a","title":"a","desc":"Vary syntax for effect, consulting references (e.g., Tufte’s"},{"code":"ELA/L.11-12.2","title":"2","desc":"Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"code":"ELA/L.11-12.2.b","title":"b","desc":"Spell correctly."},{"code":"ELA/L.11-12.2.a","title":"a","desc":"Observe hyphenation conventions."},{"code":"ELA/L.11-12.1","title":"1","desc":"Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"code":"ELA/L.11-12.1.b","title":"b","desc":"Resolve issues of complex or contested usage, consulting references (e.g.,"},{"code":"ELA/L.11-12.1.a","title":"a","desc":"Apply the understanding that usage is a matter of convention, can change over time, and is sometimes contested."},{"code":"ELA/L.9-10","title":"Grade 9-10"},{"code":"ELA/L.9-10.6","title":"6","desc":"Acquire and use accurately general academic and domain-specific words and phrases, sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when considering a word or phrase important to comprehension or expression."},{"code":"ELA/L.9-10.5","title":"5","desc":"Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"code":"ELA/L.9-10.5.b","title":"b","desc":"Analyze nuances in the meaning of words with similar denotations."},{"code":"ELA/L.9-10.5.a","title":"a","desc":"Interpret figures of speech (e.g., euphemism, oxymoron) in context and analyze their role in the text."},{"code":"ELA/L.9-10.4","title":"4","desc":"Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on"},{"code":"ELA/L.9-10.4.d","title":"d","desc":"Verify the preliminary determination of the meaning of a word or phrase (e.g., by checking the inferred meaning in context or in a dictionary)."},{"code":"ELA/L.9-10.4.c","title":"c","desc":"Consult general and specialized reference materials (e.g., dictionaries, glossaries, thesauruses), both print and digital, to find the pronunciation of a word or determine or clarify its precise meaning, its part of speech, or its etymology."},{"code":"ELA/L.9-10.4.b","title":"b","desc":"Identify and correctly use patterns of word changes that indicate different meanings or parts of speech (e.g.,"},{"code":"ELA/L.9-10.4.a","title":"a","desc":"Use context (e.g., the overall meaning of a sentence, paragraph, or text; a word’s position or function in a sentence) as a clue to the meaning of a word or phrase."},{"code":"ELA/L.9-10.3","title":"3","desc":"Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."},{"code":"ELA/L.9-10.3.a","title":"a","desc":"Write and edit work so that it conforms to the guidelines in a style manual (e.g.,"},{"code":"ELA/L.9-10.2","title":"2","desc":"Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"code":"ELA/L.9-10.2.c","title":"c","desc":"Spell correctly."},{"code":"ELA/L.9-10.2.b","title":"b","desc":"Use a colon to introduce a list or quotation."},{"code":"ELA/L.9-10.2.a","title":"a","desc":"Use a semicolon (and perhaps a conjunctive adverb) to link two or more closely related independent clauses."},{"code":"ELA/L.9-10.1","title":"1","desc":"Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"code":"ELA/L.9-10.1.b","title":"b","desc":"Use various types of phrases (noun, verb, adjectival, adverbial, participial, prepositional, absolute) and clauses (independent, dependent; noun, relative, adverbial) to convey specific meanings and add variety and interest to writing or presentations."},{"code":"ELA/L.9-10.1.a","title":"a","desc":"Use parallel structure.*"},{"code":"ELA/L.K","title":"Kindergarten"},{"code":"ELA/L.K.6","title":"6","desc":"Use words and phrases acquired through conversations, reading and being read to, and responding to texts."},{"code":"ELA/L.K.5","title":"5","desc":"With guidance and support from adults, explore word relationships and nuances in word meanings."},{"code":"ELA/L.K.5.d","title":"d","desc":"Distinguish shades of meaning among verbs describing the same general action (e.g.,"},{"code":"ELA/L.K.5.c","title":"c","desc":"Identify real-life connections between words and their use (e.g., note places at school that are colorful)."},{"code":"ELA/L.K.5.b","title":"b","desc":"Demonstrate understanding of frequently occurring verbs and adjectives by relating them to their opposites (antonyms)."},{"code":"ELA/L.K.5.a","title":"a","desc":"Sort common objects into categories (e.g., shapes, foods) to gain a sense of the concepts the categories represent."},{"code":"ELA/L.K.4","title":"4","desc":"Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on kindergarten reading and content."},{"code":"ELA/L.K.4.b","title":"b","desc":"Use the most frequently occurring inflections and affixes (e.g.,"},{"code":"ELA/L.K.4.a","title":"a","desc":"Identify new meanings for familiar words and apply them accurately (e.g., knowing"},{"code":"ELA/L.K.3","title":"3","desc":"(L.K.3 begins in grade 2)"},{"code":"ELA/L.K.2","title":"2","desc":"Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"code":"ELA/L.K.2.d","title":"d","desc":"Spell simple words phonetically, drawing on knowledge of sound-letter relationships."},{"code":"ELA/L.K.2.c","title":"c","desc":"Write a letter or letters for most consonant and short-vowel sounds (phonemes)."},{"code":"ELA/L.K.2.b","title":"b","desc":"Recognize and name end punctuation."},{"code":"ELA/L.K.2.a","title":"a","desc":"Capitalize the first word in a sentence and the pronoun"},{"code":"ELA/L.K.1","title":"1","desc":"Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"code":"ELA/L.K.1.f","title":"f","desc":"Produce and expand complete sentences in shared language activities."},{"code":"ELA/L.K.1.e","title":"e","desc":"Use the most frequently occurring prepositions (e.g.,"},{"code":"ELA/L.K.1.d","title":"d","desc":"Understand and use question words (interrogatives) (e.g.,"},{"code":"ELA/L.K.1.c","title":"c","desc":"Form regular plural nouns orally by adding /s/ or /es/ (e.g.,"},{"code":"ELA/L.K.1.b","title":"b","desc":"Use frequently occurring nouns and verbs."},{"code":"ELA/L.K.1.a","title":"a","desc":"Print many upper- and lowercase letters."},{"code":"ELA/L.8","title":"Grade 8"},{"code":"ELA/L.8.6","title":"6","desc":"Acquire and use accurately grade-appropriate general academic and domain-specific words and phrases; gather vocabulary knowledge when considering a word or phrase important to comprehension or expression."},{"code":"ELA/L.8.5","title":"5","desc":"Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"code":"ELA/L.8.5.c","title":"c","desc":"Distinguish among the connotations (associations) of words with similar denotations (definitions) (e.g.,"},{"code":"ELA/L.8.5.b","title":"b","desc":"Use the relationship between particular words to better understand each of the words."},{"code":"ELA/L.8.5.a","title":"a","desc":"Interpret figures of speech (e.g. verbal irony, puns) in context."},{"code":"ELA/L.8.4","title":"4","desc":"Determine or clarify the meaning of unknown and multiple-meaning words or phrases based on"},{"code":"ELA/L.8.4.d","title":"d","desc":"Verify the preliminary determination of the meaning of a word or phrase (e.g., by checking the inferred meaning in context or in a dictionary)."},{"code":"ELA/L.8.4.c","title":"c","desc":"Consult general and specialized reference materials (e.g., dictionaries, glossaries, thesauruses), both print and digital, to find the pronunciation of a word or determine or clarify its precise meaning or its part of speech."},{"code":"ELA/L.8.4.b","title":"b","desc":"Use common, grade-appropriate Greek or Latin affixes and roots as clues to the meaning of a word (e.g.,"},{"code":"ELA/L.8.4.a","title":"a","desc":"Use context (e.g., the overall meaning of a sentence or paragraph; a word’s position or function in a sentence) as a clue to the meaning of a word or phrase."},{"code":"ELA/L.8.3","title":"3","desc":"Use knowledge of language and its conventions when writing, speaking, reading, or listening."},{"code":"ELA/L.8.3.a","title":"a","desc":"Use verbs in the active and passive voice and in the conditional and subjunctive mood to achieve particular effects (e.g., emphasizing the actor or the action; expressing uncertainty or describing a state contrary to fact)."},{"code":"ELA/L.8.2","title":"2","desc":"Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"code":"ELA/L.8.2.c","title":"c","desc":"Spell correctly."},{"code":"ELA/L.8.2.b","title":"b","desc":"Use an ellipsis to indicate an omission."},{"code":"ELA/L.8.2.a","title":"a","desc":"Use punctuation (comma, ellipsis, dash) to indicate a pause or break."},{"code":"ELA/L.8.1","title":"1","desc":"Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"code":"ELA/L.8.1.d","title":"d","desc":"Recognize and correct inappropriate shifts in verb voice and mood.*"},{"code":"ELA/L.8.1.c","title":"c","desc":"Form and use verbs in the indicative, imperative, interrogative, conditional, and subjunctive mood."},{"code":"ELA/L.8.1.b","title":"b","desc":"Form and use verbs in the active and passive voice."},{"code":"ELA/L.8.1.a","title":"a","desc":"Explain the function of verbals (gerunds, participles, infinitives) in general and their function in particular sentences."},{"code":"ELA/L.7","title":"Grade 7"},{"code":"ELA/L.7.6","title":"6","desc":"Acquire and use accurately grade-appropriate general academic and domain-specific words and phrases; gather vocabulary knowledge when considering a word or phrase important to comprehension or expression."},{"code":"ELA/L.7.5","title":"5","desc":"Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"code":"ELA/L.7.5.c","title":"c","desc":"Distinguish among the connotations (associations) of   words with similar denotations (definitions) (e.g.,"},{"code":"ELA/L.7.5.b","title":"b","desc":"Use the relationship between particular words (e.g., synonym/antonym, analogy) to better understand each of the words."},{"code":"ELA/L.7.5.a","title":"a","desc":"Interpret figures of speech (e.g., literary, biblical, and mythological allusions) in context."},{"code":"ELA/L.7.4","title":"4","desc":"Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on"},{"code":"ELA/L.7.4.d","title":"d","desc":"Verify the preliminary determination of the meaning of a word or phrase (e.g., by checking the inferred meaning in context or in a dictionary)."},{"code":"ELA/L.7.4.c","title":"c","desc":"Consult general and specialized reference materials (e.g., dictionaries, glossaries, thesauruses), both print and digital, to find the pronunciation of a word or determine or clarify its precise meaning or its part of speech."},{"code":"ELA/L.7.4.b","title":"b","desc":"Use common, grade-appropriate Greek or Latin affixes and roots as clues to the meaning of a word (e.g.,"},{"code":"ELA/L.7.4.a","title":"a","desc":"Use context (e.g., the overall meaning of a sentence or paragraph; a word’s position or function in a sentence) as a clue to the meaning of a word or phrase."},{"code":"ELA/L.7.3","title":"3","desc":"Use knowledge of language and its conventions when writing, speaking, reading, or listening."},{"code":"ELA/L.7.3.a","title":"a","desc":"Choose language that expresses ideas precisely and concisely, recognizing and eliminating wordiness and redundancy.*"},{"code":"ELA/L.7.2","title":"2","desc":"Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"code":"ELA/L.7.2.b","title":"b","desc":"Spell correctly."},{"code":"ELA/L.7.2.a","title":"a","desc":"Use a comma to separate coordinate adjectives (e.g.,"},{"code":"ELA/L.7.1","title":"1","desc":"Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"code":"ELA/L.7.1.c","title":"c","desc":"Place phrases and clauses within a sentence, recognizing and correcting misplaced and dangling modifiers.*"},{"code":"ELA/L.7.1.b","title":"b","desc":"Choose among simple, compound, complex, and compound-complex sentences to signal differing relationships among ideas."},{"code":"ELA/L.7.1.a","title":"a","desc":"Explain the function of phrases and clauses in general and their function in specific sentences."},{"code":"ELA/L.6","title":"Grade 6"},{"code":"ELA/L.6.6","title":"6","desc":"Acquire and use accurately grade-appropriate general academic and domain-specific words and phrases; gather vocabulary knowledge when considering a word or phrase important to comprehension or expression."},{"code":"ELA/L.6.5","title":"5","desc":"Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"code":"ELA/L.6.5.c","title":"c","desc":"Distinguish among the connotations (associations) of words with similar denotations (definitions) (e.g.,"},{"code":"ELA/L.6.5.b","title":"b","desc":"Use the relationship between particular words (e.g., cause/effect, part/whole, item/category) to better understand each of the words."},{"code":"ELA/L.6.5.a","title":"a","desc":"Interpret figures of speech (e.g., personification) in context."},{"code":"ELA/L.6.4","title":"4","desc":"Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on grade 6 reading and content, choosing flexibly from a range of strategies."},{"code":"ELA/L.6.4.d","title":"d","desc":"Verify the preliminary determination of the meaning of a word or phrase (e.g., by checking the inferred meaning in context or in a dictionary)."},{"code":"ELA/L.6.4.c","title":"c","desc":"Consult reference materials (e.g., dictionaries, glossaries, thesauruses), both print and digital, to find the pronunciation of a word or determine or clarify its precise meaning or its part of speech."},{"code":"ELA/L.6.4.b","title":"b","desc":"Use common, grade-appropriate Greek or Latin affixes and roots as clues to the meaning of a word (e.g.,"},{"code":"ELA/L.6.4.a","title":"a","desc":"Use context (e.g., the overall meaning of a sentence or paragraph; a word’s position or function in a sentence) as a clue to the meaning of a word or phrase."},{"code":"ELA/L.6.3","title":"3","desc":"Use knowledge of language and its conventions when writing, speaking, reading, or listening."},{"code":"ELA/L.6.3.b","title":"b","desc":"Maintain consistency in style and tone.*"},{"code":"ELA/L.6.3.a","title":"a","desc":"Vary sentence patterns for meaning, reader/listener interest, and style.*"},{"code":"ELA/L.6.2","title":"2","desc":"Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"code":"ELA/L.6.2.b","title":"b","desc":"Spell correctly."},{"code":"ELA/L.6.2.a","title":"a","desc":"Use punctuation (commas, parentheses, dashes) to set off nonrestrictive/parenthetical elements.*"},{"code":"ELA/L.6.1","title":"1","desc":"Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"code":"ELA/L.6.1.e","title":"e","desc":"Recognize variations from standard English in their own and others’ writing and speaking, and identify and use strategies to improve expression in conventional language.*"},{"code":"ELA/L.6.1.d","title":"d","desc":"Recognize and correct vague pronouns (i.e., ones with unclear or ambiguous antecedents).*"},{"code":"ELA/L.6.1.c","title":"c","desc":"Recognize and correct inappropriate shifts in pronoun number and person.*"},{"code":"ELA/L.6.1.b","title":"b","desc":"Use intensive pronouns (e.g.,"},{"code":"ELA/L.6.1.a","title":"a","desc":"Ensure that pronouns are in the proper case (subjective, objective, possessive)."},{"code":"ELA/L.5","title":"Grade 5"},{"code":"ELA/L.5.6","title":"6","desc":"Acquire and use accurately grade-appropriate general academic and domain-specific words and phrases, including those that signal contrast, addition, and other logical relationships (e.g.,"},{"code":"ELA/L.5.5","title":"5","desc":"Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"code":"ELA/L.5.5.c","title":"c","desc":"Use the relationship between particular words (e.g., synonyms, antonyms, homographs) to better understand each of the words."},{"code":"ELA/L.5.5.b","title":"b","desc":"Recognize and explain the meaning of common idioms, adages, and proverbs."},{"code":"ELA/L.5.5.a","title":"a","desc":"Interpret figurative language, including similes and metaphors, in context."},{"code":"ELA/L.5.4","title":"4","desc":"Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on grade 5 reading and content, choosing flexibly from a range of strategies."},{"code":"ELA/L.5.4.c","title":"c","desc":"Consult reference materials (e.g., dictionaries, glossaries, thesauruses), both print and digital, to find the pronunciation and determine or clarify the precise meaning of key words and phrases."},{"code":"ELA/L.5.4.b","title":"b","desc":"Use common, grade-appropriate Greek and Latin affixes and roots as clues to the meaning of a word (e.g.,"},{"code":"ELA/L.5.4.a","title":"a","desc":"Use context (e.g., cause/effect relationships and comparisons in text) as a clue to the meaning of a word or phrase."},{"code":"ELA/L.5.3","title":"3","desc":"Use knowledge of language and its conventions when writing, speaking, reading, or listening."},{"code":"ELA/L.5.3.b","title":"b","desc":"Compare and contrast the varieties of English (e.g.,"},{"code":"ELA/L.5.3.a","title":"a","desc":"Expand, combine, and reduce sentences for meaning, reader/listener interest, and style."},{"code":"ELA/L.5.2","title":"2","desc":"Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"code":"ELA/L.5.2.e","title":"e","desc":"Spell grade-appropriate words correctly, consulting references as needed."},{"code":"ELA/L.5.2.d","title":"d","desc":"Use underlining, quotation marks, or italics to indicate titles of works."},{"code":"ELA/L.5.2.c","title":"c","desc":"Use a comma to set off the words"},{"code":"ELA/L.5.2.b","title":"b","desc":"Use a comma to separate an introductory element from the rest of the sentence."},{"code":"ELA/L.5.2.a","title":"a","desc":"Use punctuation to separate items in a series.*"},{"code":"ELA/L.5.1","title":"1","desc":"Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"code":"ELA/L.5.1.e","title":"e","desc":"Use correlative conjunctions (e.g.,"},{"code":"ELA/L.5.1.d","title":"d","desc":"Recognize and correct inappropriate shifts in verb tense.*"},{"code":"ELA/L.5.1.c","title":"c","desc":"Use verb tense to convey various times, sequences, states, and conditions."},{"code":"ELA/L.5.1.b","title":"b","desc":"Form and use the perfect (e.g.,"},{"code":"ELA/L.5.1.a","title":"a","desc":"Explain the function of conjunctions, prepositions, and interjections in general and their function in particular sentences."},{"code":"ELA/L.4","title":"Grade 4"},{"code":"ELA/L.4.6","title":"6","desc":"Acquire and use accurately grade-appropriate general academic and domain-specific words and phrases, including those that signal precise actions, emotions, or states of being (e.g., quizzed, whined, stammered) and that are basic to a particular topic (e.g.,"},{"code":"ELA/L.4.5","title":"5","desc":"Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"code":"ELA/L.4.5.c","title":"c","desc":"Demonstrate understanding of words by relating them to their opposites (antonyms) and to words with similar but not identical meanings (synonyms)."},{"code":"ELA/L.4.5.b","title":"b","desc":"Recognize and explain the meaning of common idioms, adages, and proverbs."},{"code":"ELA/L.4.5.a","title":"a","desc":"Explain the meaning of simple similes and metaphors (e.g.,"},{"code":"ELA/L.4.4","title":"4","desc":"Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on grade 4 reading and content, choosing flexibly from a range of strategies."},{"code":"ELA/L.4.4.c","title":"c","desc":"Consult reference materials (e.g., dictionaries, glossaries, thesauruses), both print and digital, to find the pronunciation and determine or clarify the precise meaning of key words and phrases."},{"code":"ELA/L.4.4.b","title":"b","desc":"Use common, grade-appropriate Greek and Latin affixes and roots as clues to the meaning of a word (e.g.,"},{"code":"ELA/L.4.4.a","title":"a","desc":"Use context (e.g., definitions, examples, or restatements in text) as a clue to the meaning of a word or phrase."},{"code":"ELA/L.4.3","title":"3","desc":"Use knowledge of language and its conventions when writing, speaking, reading, or listening."},{"code":"ELA/L.4.3.c","title":"c","desc":"Differentiate between contexts that call for formal English (e.g., presenting ideas) and situations where informal discourse is appropriate (e.g., small-group discussion)."},{"code":"ELA/L.4.3.b","title":"b","desc":"Choose punctuation for effect.*"},{"code":"ELA/L.4.3.a","title":"a","desc":"Choose words and phrases to convey ideas precisely.*"},{"code":"ELA/L.4.2","title":"2","desc":"Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"code":"ELA/L.4.2.d","title":"d","desc":"Spell grade-appropriate words correctly, consulting references as needed."},{"code":"ELA/L.4.2.c","title":"c","desc":"Use a comma before a coordinating conjunction in a compound sentence."},{"code":"ELA/L.4.2.b","title":"b","desc":"Use commas and quotation marks to mark direct speech and quotations from a text."},{"code":"ELA/L.4.2.a","title":"a","desc":"Use correct capitalization."},{"code":"ELA/L.4.1","title":"1","desc":"Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"code":"ELA/L.4.1.g","title":"g","desc":"Correctly use frequently confused words (e.g.,"},{"code":"ELA/L.4.1.f","title":"f","desc":"Produce complete sentences, recognizing and correcting inappropriate fragments and run-ons.*"},{"code":"ELA/L.4.1.e","title":"e","desc":"Form and use prepositional phrases."},{"code":"ELA/L.4.1.d","title":"d","desc":"Order adjectives within sentences according to conventional patterns (e.g.,"},{"code":"ELA/L.4.1.c","title":"c","desc":"Use modal auxiliaries (e.g.,"},{"code":"ELA/L.4.1.b","title":"b","desc":"Form and use the progressive (e.g.,"},{"code":"ELA/L.4.1.a","title":"a","desc":"Use relative pronouns ("},{"code":"ELA/L.3","title":"Grade 3"},{"code":"ELA/L.3.6","title":"6","desc":"Acquire and use accurately grade-appropriate conversational, general academic, and domain-specific words and phrases, including those that signal spatial and temporal relationships (e.g.,"},{"code":"ELA/L.3.5","title":"5","desc":"Demonstrate understanding of figurative language, word relationships and nuances in word meanings."},{"code":"ELA/L.3.5.c","title":"c","desc":"Distinguish shades of meaning among related words that describe states of mind or degrees of certainty (e.g.,"},{"code":"ELA/L.3.5.b","title":"b","desc":"Identify real-life connections between words and their use (e.g., describe people who are"},{"code":"ELA/L.3.5.a","title":"a","desc":"Distinguish the literal and nonliteral meanings of words and phrases in context (e.g.,"},{"code":"ELA/L.3.4","title":"4","desc":"Determine or clarify the meaning of unknown and multiple-meaning word and phrases based on grade 3 reading and content, choosing flexibly from a range of strategies."},{"code":"ELA/L.3.4.d","title":"d","desc":"Use glossaries or beginning dictionaries, both print and digital, to determine or clarify the precise meaning of key words and phrases."},{"code":"ELA/L.3.4.c","title":"c","desc":"Use a known root word as a clue to the meaning of an unknown word with the same root (e.g.,"},{"code":"ELA/L.3.4.b","title":"b","desc":"Determine the meaning of the new word formed when a known affix is added to a known word (e.g.,"},{"code":"ELA/L.3.4.a","title":"a","desc":"Use sentence-level context as a clue to the meaning of a word or phrase."},{"code":"ELA/L.3.3","title":"3","desc":"Use knowledge of language and its conventions when writing, speaking, reading, or listening."},{"code":"ELA/L.3.3.b","title":"b","desc":"Recognize and observe differences between the conventions of spoken and written standard English."},{"code":"ELA/L.3.3.a","title":"a","desc":"Choose words and phrases for effect.*"},{"code":"ELA/L.3.2","title":"2","desc":"Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"code":"ELA/L.3.2.g","title":"g","desc":"Consult reference materials, including beginning dictionaries, as needed to check and correct spellings."},{"code":"ELA/L.3.2.f","title":"f","desc":"Use spelling patterns and generalizations (e.g.,"},{"code":"ELA/L.3.2.e","title":"e","desc":"Use conventional spelling for high-frequency and other studied words and for adding suffixes to base words (e.g.,"},{"code":"ELA/L.3.2.d","title":"d","desc":"Form and use possessives."},{"code":"ELA/L.3.2.c","title":"c","desc":"Use commas and quotation marks in dialogue."},{"code":"ELA/L.3.2.b","title":"b","desc":"Use commas in addresses."},{"code":"ELA/L.3.2.a","title":"a","desc":"Capitalize appropriate words in titles."},{"code":"ELA/L.3.1","title":"1","desc":"Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"code":"ELA/L.3.1.i","title":"i","desc":"Produce simple, compound, and complex sentences."},{"code":"ELA/L.3.1.h","title":"h","desc":"Use coordinating and subordinating conjunctions."},{"code":"ELA/L.3.1.g","title":"g","desc":"Form and use comparative and superlative adjectives and adverbs, and choose between them depending on what is to be modified."},{"code":"ELA/L.3.1.f","title":"f","desc":"Ensure subject-verb and pronoun-antecedent agreement.*"},{"code":"ELA/L.3.1.e","title":"e","desc":"Form and use the simple (e.g.,"},{"code":"ELA/L.3.1.d","title":"d","desc":"Form and use regular and irregular verbs."},{"code":"ELA/L.3.1.c","title":"c","desc":"Use abstract nouns (e.g.,"},{"code":"ELA/L.3.1.b","title":"b","desc":"Form and use regular and irregular plural nouns."},{"code":"ELA/L.3.1.a","title":"a","desc":"Explain the function of nouns, pronouns, verbs, adjectives, and adverbs in general and their functions in particular sentences."},{"code":"ELA/L.2","title":"Grade 2"},{"code":"ELA/L.2.6","title":"6","desc":"Use words and phrases acquired through conversations, reading and being read to, and responding to texts, including using adjectives and adverbs to describe (e.g.,"},{"code":"ELA/L.2.5","title":"5","desc":"Demonstrate understanding of word relationships and nuances in word meanings."},{"code":"ELA/L.2.5.b","title":"b","desc":"Distinguish shades of meaning among closely related verbs (e.g.,"},{"code":"ELA/L.2.5.a","title":"a","desc":"Identify real-life connections between words and their use (e.g.,"},{"code":"ELA/L.2.4","title":"4","desc":"Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on grade 2 reading and content, choosing flexibly from an array of strategies."},{"code":"ELA/L.2.4.e","title":"e","desc":"Use glossaries and beginning dictionaries, both print and digital, to determine or clarify the meaning of words and phrases."},{"code":"ELA/L.2.4.d","title":"d","desc":"Use knowledge of the meaning of individual words to predict the meaning of compound words (e.g.,"},{"code":"ELA/L.2.4.c","title":"c","desc":"Use a known root word as a clue to the meaning of an unknown word with the same root (e.g.,"},{"code":"ELA/L.2.4.b","title":"b","desc":"Determine the meaning of the new word formed when a known prefix is added to a known word (e.g.,"},{"code":"ELA/L.2.4.a","title":"a","desc":"Use sentence-level context as a clue to the meaning of a word or phrase."},{"code":"ELA/L.2.3","title":"3","desc":"Use knowledge of language and its conventions when writing, speaking, reading, or listening."},{"code":"ELA/L.2.3.a","title":"a","desc":"Compare formal and informal uses of English"},{"code":"ELA/L.2.2","title":"2","desc":"Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"code":"ELA/L.2.2.e","title":"e","desc":"Consult reference materials, including beginning dictionaries, as needed to check and correct spellings."},{"code":"ELA/L.2.2.d","title":"d","desc":"Generalize learned spelling patterns when writing words (e.g.,"},{"code":"ELA/L.2.2.c","title":"c","desc":"Use an apostrophe to form contractions and frequently occurring possessives."},{"code":"ELA/L.2.2.b","title":"b","desc":"Use commas in greetings and closings of letters."},{"code":"ELA/L.2.2.a","title":"a","desc":"Capitalize holidays, product names, and geographic names."},{"code":"ELA/L.2.1","title":"1","desc":"Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"code":"ELA/L.2.1.f","title":"f","desc":"Produce, expand, and rearrange complete simple and compound sentences (e.g.,"},{"code":"ELA/L.2.1.e","title":"e","desc":"Use adjectives and adverbs, and choose between them depending on what is to be modified."},{"code":"ELA/L.2.1.d","title":"d","desc":"Form and use the past tense of frequently occurring irregular verbs (e.g.,"},{"code":"ELA/L.2.1.c","title":"c","desc":"Use reflexive pronouns (e.g.,"},{"code":"ELA/L.2.1.b","title":"b","desc":"Form and use frequently occurring irregular plural nouns (e.g.,"},{"code":"ELA/L.2.1.a","title":"a","desc":"Use collective nouns (e.g.,"},{"code":"ELA/L.1","title":"Grade 1"},{"code":"ELA/L.1.6","title":"6","desc":"Use words and phrases acquired through conversations, reading and being read to, and responding to texts, including using frequently occurring conjunctions to signal simple relationships (e.g.,"},{"code":"ELA/L.1.5","title":"5","desc":"With guidance and support from adults, demonstrate understanding of word relationships and nuances in word meanings."},{"code":"ELA/L.1.5.d","title":"d","desc":"Distinguish shades of meaning among verbs differing in manner (e.g.,"},{"code":"ELA/L.1.5.c","title":"c","desc":"Identify real-life connections between words and their use (e.g., note places at home that are"},{"code":"ELA/L.1.5.b","title":"b","desc":"Define words by category and by one or more key attributes (e.g., a"},{"code":"ELA/L.1.5.a","title":"a","desc":"Sort words into categories (e.g., colors, clothing) to gain a sense of the concepts the categories represent."},{"code":"ELA/L.1.4","title":"4","desc":"Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on"},{"code":"ELA/L.1.4.c","title":"c","desc":"Identify frequently occurring root words (e.g.,"},{"code":"ELA/L.1.4.b","title":"b","desc":"Use frequently occurring affixes as a clue to the meaning of a word."},{"code":"ELA/L.1.4.a","title":"a","desc":"Use sentence-level context as a clue to the meaning of a word or phrase."},{"code":"ELA/L.1.3","title":"3","desc":"(L.1.3 begins in grade 2)"},{"code":"ELA/L.1.2","title":"2","desc":"Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"code":"ELA/L.1.2.e","title":"e","desc":"Spell untaught words phonetically, drawing on phonemic awareness and spelling conventions."},{"code":"ELA/L.1.2.d","title":"d","desc":"Use conventional spelling for words with common spelling patterns and for frequently occurring irregular words."},{"code":"ELA/L.1.2.c","title":"c","desc":"Use commas in dates and to separate single words in a series."},{"code":"ELA/L.1.2.b","title":"b","desc":"Use end punctuation for sentences."},{"code":"ELA/L.1.2.a","title":"a","desc":"Capitalize dates and names of people."},{"code":"ELA/L.1.1","title":"1","desc":"Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"code":"ELA/L.1.1.j","title":"j","desc":"Produce and expand complete simple and compound declarative, interrogative, imperative, and exclamatory sentences in response to prompts."},{"code":"ELA/L.1.1.i","title":"i","desc":"Use frequently occurring prepositions (e.g.,"},{"code":"ELA/L.1.1.h","title":"h","desc":"Use determiners (e.g., articles, demonstratives)."},{"code":"ELA/L.1.1.g","title":"g","desc":"Use frequently occurring conjunctions (e.g.,"},{"code":"ELA/L.1.1.f","title":"f","desc":"Use frequently occurring adjectives."},{"code":"ELA/L.1.1.e","title":"e","desc":"Use verbs to convey a sense of past, present, and future (e.g., Yesterday I walked home; Today I walk home; Tomorrow I will walk home)."},{"code":"ELA/L.1.1.d","title":"d","desc":"Use personal, possessive, and indefinite pronouns (e.g., I, me, my; they, them, their, anyone, everything)."},{"code":"ELA/L.1.1.c","title":"c","desc":"Use singular and plural nouns with matching verbs in basic sentences (e.g., He hops; We hop)."},{"code":"ELA/L.1.1.b","title":"b","desc":"Use common, proper, and possessive nouns."},{"code":"ELA/L.1.1.a","title":"a","desc":"Print all upper- and lowercase letters."},{"code":"ELA/CCRA","title":"Anchor Standards"},{"code":"ELA/CCRA.W","title":"College and Career Readiness Anchor Standards for Writing","desc":"The K-12 standards on the following pages define what students should understand and be able to do by the end of each grade. They correspond to the College and Career Readiness (CCR) anchor standards below by number. The CCR and grade-specific standards are necessary complements—the former providing broad standards, the latter providing additional specificity—that together define the skills and understandings that all students must demonstrate."},{"code":"ELA/CCRA.W.10","title":"10","desc":"Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences."},{"code":"ELA/CCRA.W.9","title":"9","desc":"Draw evidence from literary or informational texts to support analysis, reflection, and research."},{"code":"ELA/CCRA.W.8","title":"8","desc":"Gather relevant information from multiple print and digital sources, assess the credibility and accuracy of each source, and integrate the information while avoiding plagiarism."},{"code":"ELA/CCRA.W.7","title":"7","desc":"Conduct short as well as more sustained research projects based on focused questions, demonstrating understanding of the subject under investigation."},{"code":"ELA/CCRA.W.6","title":"6","desc":"Use technology, including the Internet, to produce and publish writing and to interact and collaborate with others."},{"code":"ELA/CCRA.W.5","title":"5","desc":"Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach."},{"code":"ELA/CCRA.W.4","title":"4","desc":"Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience."},{"code":"ELA/CCRA.W.3","title":"3","desc":"Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details and well-structured event sequences."},{"code":"ELA/CCRA.W.2","title":"2","desc":"Write informative/explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."},{"code":"ELA/CCRA.W.1","title":"1","desc":"Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."},{"code":"ELA/CCRA.SL","title":"College and Career Readiness Anchor Standards for Speaking and Listening","desc":"The K-12 standards on the following pages define what students should understand and be able to do by the end of each grade. They correspond to the College and Career Readiness (CCR) anchor standards below by number. The CCR and grade-specific standards are necessary complements—the former providing broad standards, the latter providing additional specificity—that together define the skills and understandings that all students must demonstrate."},{"code":"ELA/CCRA.SL.6","title":"6","desc":"Adapt speech to a variety of contexts and communicative tasks, demonstrating command of formal English when indicated or appropriate."},{"code":"ELA/CCRA.SL.5","title":"5","desc":"Make strategic use of digital media and visual displays of data to express information and enhance understanding of presentations."},{"code":"ELA/CCRA.SL.4","title":"4","desc":"Present information, findings, and supporting evidence such that listeners can follow the line of reasoning and the organization, development, and style are appropriate to task, purpose, and audience."},{"code":"ELA/CCRA.SL.3","title":"3","desc":"Evaluate a speaker’s point of view, reasoning, and use of evidence and rhetoric."},{"code":"ELA/CCRA.SL.2","title":"2","desc":"Integrate and evaluate information presented in diverse media and formats, including visually, quantitatively, and orally."},{"code":"ELA/CCRA.SL.1","title":"1","desc":"Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others’ ideas and expressing their own clearly and persuasively."},{"code":"ELA/CCRA.R","title":"College and Career Readiness Anchor Standards for Reading","desc":"The K-12 standards on the following pages define what students should understand and be able to do by the end of each grade. They correspond to the College and Career Readiness (CCR) anchor standards below by number. The CCR and grade-specific standards are necessary complements—the former providing broad standards, the latter providing additional specificity—that together define the skills and understandings that all students must demonstrate."},{"code":"ELA/CCRA.R.10","title":"10","desc":"Read and comprehend complex literary and informational texts independently and proficiently."},{"code":"ELA/CCRA.R.9","title":"9","desc":"Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."},{"code":"ELA/CCRA.R.8","title":"8","desc":"Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."},{"code":"ELA/CCRA.R.7","title":"7","desc":"Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words."},{"code":"ELA/CCRA.R.6","title":"6","desc":"Assess how point of view or purpose shapes the content and style of a text."},{"code":"ELA/CCRA.R.5","title":"5","desc":"Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole."},{"code":"ELA/CCRA.R.4","title":"4","desc":"Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone."},{"code":"ELA/CCRA.R.3","title":"3","desc":"Analyze how and why individuals, events, or ideas develop and interact over the course of a text."},{"code":"ELA/CCRA.R.2","title":"2","desc":"Determine central ideas or themes of a text and analyze their development; summarize the key supporting details and ideas."},{"code":"ELA/CCRA.R.1","title":"1","desc":"Read closely to determine what the text says explicitly and to make logical inferences from it; cite specific textual evidence when writing or speaking to support conclusions drawn from the text."},{"code":"ELA/CCRA.L","title":"College and Career Readiness Anchor Standards for Language","desc":"The K-12 standards on the following pages define what students should understand and be able to do by the end of each grade. They correspond to the College and Career Readiness (CCR) anchor standards below by number. The CCR and grade-specific standards are necessary complements—the former providing broad standards, the latter providing additional specificity—that together define the skills and understandings that all students must demonstrate."},{"code":"ELA/CCRA.L.6","title":"6","desc":"Acquire and use accurately a range of general academic and domain-specific words and phrases sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when encountering an unknown term important to comprehension or expression."},{"code":"ELA/CCRA.L.5","title":"5","desc":"Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"code":"ELA/CCRA.L.4","title":"4","desc":"Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."},{"code":"ELA/CCRA.L.3","title":"3","desc":"Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."},{"code":"ELA/CCRA.L.2","title":"2","desc":"Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"code":"ELA/CCRA.L.1","title":"1","desc":"Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."}]